{
    "data": [
    {
        "id": "db898cbb-ac13-408e-b94e-105aa35ac0b4",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/db898cbb-ac13-408e-b94e-105aa35ac0b4",
        "created_at": "Fri Feb 26 15:58:52 UTC 2021",
        "company": "Media Predict Inc.",
        "company_url": "http:",
        "location": "remote / East Coast USA",
        "title": "Senior Python/FullStack developer",
        "description": "<p>Our development needs are growing quickly, and we are looking for strong, qualified candidates to join our team. Our systems are Python/Django applications with JavaScript/React and Postgres hosted on AWS/Heroku. Candidates with the relevant experience are encouraged to apply.</p>\n<h3>Must haves</h3>\n<ul>\n<li>Fluent in English, written and spoken + U.S. work permit</li>\n<li>Real projects experience in Python (7+) and Django (2+)</li>\n</ul>\n<h3>Nice to haves</h3>\n<ul>\n<li>Good degree of familiarity with modern client-side web technologies - we mainly use React, for smaller things jQuery</li>\n<li>Version control tool skills</li>\n<li>Clean code base covered with tests. It is not a problem if you haven't used Unit testing or CI yet. We will get you on board quickly</li>\n<li>7+ years experience in professional software development (10+ would be ideal)</li>\n</ul>\n<h3>Responsibilities</h3>\n<p>Writing reusable, testable, and efficient code. Develop new features and improve existing features of the software. Performance improvements, maintenance and bug fixes. Contribute to team and organisational improvements in process and infrastructure. Code, test and operate Python based services and applications.</p>\n<h3>Things you might like</h3>\n<ul>\n<li>Small team - room for input, short decision-making processes</li>\n<li>Code testing and quality reviews so we can continuously and automatically release new versions</li>\n<li>Varied responsibilities: server/client side, code, test, maintain, review, deploy</li>\n<li>Free to move: while we are based in the New York City/Southwest Connecticut area, this can be a 100% remote position</li>\n</ul>\n<h3>About the Company</h3>\n<p>Media Predict is a media and marketing research company that utilizes prediction markets - in tandem with complimentary research methods such as custom surveys and online dial testing - to generate primary market research for consumer-facing industries, such as media, consumer packaged goods, technology, financial services, and restaurants. It does this in countries throughout the world. The company has developed and operates online game sites in North America and Europe as part of its research infrastructure.</p>\n<h3>Other</h3>\n<ul>\n<li>Telecommuting is OK</li>\n<li>No Agencies Please</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:igor.kramaric@mediapredict.com\">igor.kramaric@mediapredict.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--71667e08d8c8983c6f370da65dd8a3918f6f6ac7/1519861155804.png"
    },
    {
        "id": "7b0883ae-f231-4e6c-9c46-1b85b0a0bb93",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7b0883ae-f231-4e6c-9c46-1b85b0a0bb93",
        "created_at": "Fri Feb 26 13:28:33 UTC 2021",
        "company": "McKinsey & Company",
        "company_url": "http:",
        "location": "Wroclaw / Lisbon",
        "title": "Software Engineer",
        "description": "<p>McKinsey’s Client Capabilities Network cultivates innovation and expertise.</p>\n<p>Our client capabilities colleagues help clients solve their most challenging problems by providing them with research, advanced analytics and engineering knowledge across many industries (retail, telecommunications, pharmaceuticals, automotive) and business functions (digital, marketing, operations).</p>\n<p>When you join our Client Capabilities Network, you can build on your strengths and professional passions, and challenge yourself by finding solutions for problems that don’t always have an easy answer. We are looking for people with diverse educational and professional backgrounds —people who can help build the firm’s capabilities and create positive and enduring change through improving the communities in which we work and live.</p>\n<p>We invite you to join us in Lisbon or Wroclaw as a Data Engineer. To learn more about life as a client capabilities professional at McKinsey, visit our website.</p>\n<p>QUALIFICATIONS</p>\n<ul>\n<li>Degree in computer science or equivalent area</li>\n<li>1 – 4 years of work experience in software engineering</li>\n<li>Hands-on skills working with SQL and No-SQL databases</li>\n<li>Experience across the following application development technologies and in-depth skills with at least one: Java, Kotlin, Go, Ruby, JavaScript, Node.js, React, Scala, Elixir, Python, Erlang</li>\n<li>Experience with DevOps and cloud infrastructure such as AWS, Azure, GCP, Docker, Kubernetes, Jenkins, Git, Ansible</li>\n<li>Experience in engineering practices such as code refactoring, design patterns, design/test driven development, continuous integration, building highly scalable applications, application security and software testing</li>\n<li>Knowledge of agile software development process</li>\n<li>Interest in learning new coding languages, platforms, and cloud technologies</li>\n<li>Ability to quickly adapt to new tools and fast changing requirements on a project</li>\n<li>Strong command of English language (both verbal and written)</li>\n</ul>\n<p>WHO YOU'LL WORK WITH</p>\n<p>You’ll be based in our Lisbon or Wroclaw office and will be part of our Client Capabilities Network (CCN).You will work with product management and design colleagues to deliver software products with high levels of value, usability, quality and predictability for our clients.</p>\n<p>As a Software Engineer, you will develop an expertise in an industry(e.g. Advanced Industries, Energy &amp; Materials, Banking, Insurance, Consumer, Telecommunications, Pharma, Private Equity) or business function (Marketing and Sales, Operations, Corporate Finance, Risk, Digital, Transformation, Sustainability) that is of interest to you and aligned to your background. Leaders in these groups will provide mentorship and sponsorship and help you further build your capabilities.</p>\n<p>Our more than 2,500 client capabilities professionals across the globe work alongside our consultants to deliver Change that Matters to our clients. They support our consultant teams, both remotely and at client sites, in an agile and targeted way. Further, they are core to our firm’s R&amp;D, developing new knowledge and building and refining proprietary capabilities (e.g., assets, data sets), as well as curating, managing, and maintaining them. Our portfolio includes state-of-the-art research, asset-backed and rapid diagnostics, benchmarking, and workflow support. Our professionals have deep expertise and are able to apply a broad range of methodologies for specialized on-demand analyses.</p>\n<p>WHAT YOU'LL DO</p>\n<p>You will solve engineering problems in multiple domains and will support client project teams with tech enablement and building reusable technology platforms.</p>\n<p>In this role you will strive to write clean, usable, and scalable code, while following an agile development process. You will utilize the latest in software development best practices.</p>\n<p>As an engineer, you will develop deep technical expertise, leadership and management skills. You will keep up with industry trends and innovations and apply knowledge to the existing codebase. You will be an active learner, identifying new products to take to your clients. You will use unfamiliar technologies and learn new programming languages to meet technical requirements.</p>\n<p>You will play an advisory role in asset development and as a trusted technical expert, you will help guide non-technical colleagues on how technology can be leveraged for their clients.  You'll identify and escalate technical barriers, dependencies or risks and you'll understand the value of the user story and how to best deliver the appropriate functionality.</p>\n<p>You will manage yourself day to day with regards to priorities, time and commitments within your team setting while ensuring that technical standards and best practices are exercised, while maintaining a distinct value and quality mindset.</p>\n<p>Please submit your application by 12 March 2021</p>\n",
        "how_to_apply": "<p>Apply via our website: <a href=\"https://www.mckinsey.com/careers/search-jobs/jobs/softwareengineer-clientcapabilitiesnetwork-47399\">https://www.mckinsey.com/careers/search-jobs/jobs/softwareengineer-clientcapabilitiesnetwork-47399</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnlhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fcec4bd4e868d975760873b8ade1de1474c0e994/McKinsey-recruiting-email-banner_4%20(1).jpg"
    },
    {
        "id": "6d3d6fa2-1861-46ac-be3c-177e03aad62b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6d3d6fa2-1861-46ac-be3c-177e03aad62b",
        "created_at": "Thu Feb 25 22:20:15 UTC 2021",
        "company": "Build Change",
        "company_url": "https://buildchange.org/",
        "location": "Remote",
        "title": "Chief Technology Officer",
        "description": "<p>WORK FOR AN AWARD-WINNING NON-PROFIT SOCIAL ENTERPRISE</p>\n<p>Job Title: Chief Technology Officer</p>\n<p>Industry: Non-profit/International Development</p>\n<p>Job Location: Global – Work from home &amp; regular travel</p>\n<p>Start Date: Immediate</p>\n<p>Term: At-will employment</p>\n<p>Salary: Competitive, based on experience</p>\n<p>WHO WE ARE</p>\n<p>Founded in 2004, Build Change is an innovative international non‐profit social enterprise whose mission is to save lives in earthquakes and hurricanes. We do that by designing disaster-resistant houses and schools; training homeowners, builders, engineers and government officials to build them; working with governments to develop and implement building standards; partnering with the private sector to improve building materials quality and create jobs; and facilitating access to incentive-based capital for reconstruction and retrofitting by partnering with financing institutions and government subsidy programs.</p>\n<p>Build Change is the recipient of multiple awards, including a 2017 Skoll Foundation Award for Social Entrepreneurship, OpenIDEO Urban Resilience Challenge Winner, and was a top three finalist in IBM’s inaugural Call for Code Developer Challenge in 2018.</p>\n<p>To learn more about us and our programs in Colombia, Nepal, the Philippines and the Caribbean, visit <a href=\"http://www.buildchange.org\">www.buildchange.org</a>.</p>\n<p>YOUR NEW OPPORTUNITY</p>\n<p>Build Change’s Technology Division is seeking to head its activities around the world.</p>\n<p>This position reports to the CEO.</p>\n<p>POSITION RESPONSIBILITIES</p>\n<p>*Head Build Change’s Technology Division</p>\n<p>*Implement Build Change’s strategy</p>\n<p>*Represent Build Change in front of key technology stakeholders such as donors, partners, subcontractors and clients</p>\n<p>*Lead Build Change’s software development team</p>\n<p>*Nurture and recruit required talent for the Technology team, and support the Build Change’s programs around the world in recruiting and/or sourcing new software development talent</p>\n<p>*Manage the timely delivery of work packages from remote coding capacities, including Build Change software based in other countries and non-Build Change software developers working for third-party software development service providers</p>\n<p>*Manage the referencing of existing in-house developed software and the establishment of an internal code depository</p>\n<p>*Ensure that all global systems are accessible, branded, operational and disruption-free</p>\n<p>*Establish cyber-security protocols and manage their implementation across all activities</p>\n<p>*Ensure program-balanced budgets</p>\n<p>*Ensure that deliverables/milestones for projects for which you are responsible for are delivered according to time and budget</p>\n<p>*Be solution-oriented and ensure the timely delivery of functioning client-ready mobile applications and web portals in accordance to allocated resources</p>\n<p>*Train and mentor the coding team under your responsibility</p>\n<p>*Produce internal monthly reports and, when required, internal reports for the CEO and Board of Directors</p>\n<p>OTHER RESPONSIBILITIES</p>\n<p>Opportunity-dependent:</p>\n<p>*Work from home, while collaborating with colleagues located around the world (Asia, Europe, Africa, North America and South America)</p>\n<p>*Travel, when necessary (no more than 25% of your time on average), to support the delivery of software products around the world, or to participate in presenting your work and Build Change’s technology innovations at conferences or at meetings with clients, partners and donors</p>\n<p>*Support business development efforts to develop technology components in concepts and proposals</p>\n<p>*Support the CEO and the business development team in creating and delivering presentations’ slide decks, sales pitches, and promotional videos with the objective of securing new funding for Build Change technology related activities</p>\n<p>*Support the development of a business model and monetization strategy from Build Change technology services and products</p>\n<p>*Perform additional duties as required by your supervisor</p>\n<p>OUR IDEAL CANDIDATE</p>\n<p>YOU HAVE:</p>\n<p>-10 years' minimum experience leading teams of software developers, specifically leading the development of mobile applications and web portals</p>\n<p>-Advance college degree in Information Technology or related field</p>\n<p>YOUR EXPERIENCE INCLUDES:</p>\n<p>-Managing the delivery of software work packages from large teams consisting of developers reporting to you as well as from third-party software development providers</p>\n<p>-Rolling out and ensuring the maintenance of mobile applications and web portals</p>\n<p>-Managing de-localized teams, including team members in similar time zones and developers in very different time zones</p>\n<p>-Working closely with product design and business teams to bring a software product to market</p>\n<p>-Recruiting developers as well as building and maintaining a software development team</p>\n<p>-Contractually managing the performance and timely delivery of software deliverables produced by third-party software development providers</p>\n<p>-Developing and rolling out Artificial Intelligence (AI) functionalities</p>\n<p>-Developing and rolling out Augmented Reality (AR) or Mixed Reality (MR) functionalities</p>\n<p>-Experience calibrating and rolling-out UXs for non-technical / everyday users</p>\n<p>YOU ARE ABLE TO:</p>\n<p>-Recruit and manage a team consisting of, but not limited to, the following specialties:</p>\n<p>--&gt;React Native developers</p>\n<p>--&gt;Full Stack developers</p>\n<p>--&gt;Machine Learning engineers</p>\n<p>--&gt;Python developers</p>\n<p>--&gt;Dynamo developers</p>\n<p>--&gt;3D animation and AR experts</p>\n<p>--&gt;BIM experts</p>\n<p>YOU WOULD DESCRIBE YOURSELF AS;</p>\n<p>-Drama-free, optimistic, flexible, humble, patient, and having a good sense of humor</p>\n<p>-Fluent in English</p>\n<p>AND MAYBE YOU ALSO:</p>\n<p>-Have worked in the Caribbean, Latin America, Asia or emerging nations</p>\n<p>-Speak Spanish or any of the languages spoken in our program countries</p>\n<p>-Have experience successfully developing, rolling out and maintaining software in emerging nations</p>\n<p>-Have experience working on software that is connected to Building Information Modeling (BIM)</p>\n<p>ARE YOU INTERESTED?</p>\n<p>Then please visit <a href=\"http://www.buildchange.org/about/careers\">www.buildchange.org/about/careers</a> and select the link for this position. Applications will be accepted until filled and will be reviewed as received. Only shortlisted candidates will be contacted. No calls please.</p>\n",
        "how_to_apply": "<p>Click \"Apply Now\" on our website's posting of the position: <a href=\"https://buildchange.applicantstack.com/x/detail/a2cn2wdfh30a\">https://buildchange.applicantstack.com/x/detail/a2cn2wdfh30a</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTZhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--005520e7583b36a20a2badef9cb2600d20876aeb/BuildChange_Hex_Final_wide.png"
    },
    {
        "id": "0ccabe77-7f42-4828-b7c4-c1066999f2a6",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0ccabe77-7f42-4828-b7c4-c1066999f2a6",
        "created_at": "Thu Feb 25 20:00:51 UTC 2021",
        "company": "Bit Zesty",
        "company_url": "https://bitzesty.com",
        "location": "Remote",
        "title": "Ruby on Rails Developer (Remote)",
        "description": "<p>We’re a multi-award-winning digital product development agency, working with corporations, charities, government and start-ups since 2009.</p>\n<p>From the beginning, we established remote working practices. We believe it gives our team a better work-life balance, more autonomy and flexibility, plus helps us to do our bit in preserving the environment.</p>\n<h2>The Opportunity</h2>\n<p>We have a vacancy for an experienced Ruby on Rails Developer to join us on a full-time basis. In this role, you’ll join a skilled team of Developers creating high quality, scalable products for our clients. You’ll work closely with our Project Managers, UX Designers and Technical Director, focussing on both maintenance and new development of software applications.</p>\n<p>This role would be ideally suited to someone who likes working with Ruby on Rails and is keen to work as part of a team on a range of different projects. If you enjoy creating dynamic web applications and are passionate about clean code, we would love to hear from you.</p>\n<h2>The Job</h2>\n<p>On a day to day basis, you’ll be involved with the following:</p>\n<ul>\n<li>Writing efficient, reusable, and reliable Ruby code</li>\n<li>Identifying performance issues and bugs, and providing solutions to these problems</li>\n<li>Conducting regular Ruby on Rails version upgrades</li>\n<li>Participating in code reviews</li>\n<li>Contributing to creating a culture of writing excellent software</li>\n<li>Taking wireframes/mockups and user stories and build systems that meet the requirements</li>\n</ul>\n<h2>The Person</h2>\n<p>Ideally, we’re looking for someone with the following:</p>\n<ul>\n<li>Experienced Ruby on Rails Developer with exposure to multiple applications</li>\n<li>Comfortable working on existing codebases</li>\n<li>Experience of working with live applications including ongoing maintenance</li>\n<li>Knowledge of SQL experience (MySQL/PostgreSQL) and NoSQL (MongoDB/ElasticSearch/CouchDB)</li>\n<li>Interested in learning new technologies (for example, Elixir, React Native)</li>\n<li>Comfortable working across multiple projects and able to switch between them as required</li>\n<li>Happy to work mostly synchronously as part of a team</li>\n<li>Great attention to detail</li>\n<li>Previous agency experience would be advantageous</li>\n<li>A degree in Computer Science, Software Engineering or a related subject is desirable</li>\n</ul>\n<h2>The Perks</h2>\n<p>At Bit Zesty, we offer a range of perks and benefits to help you enjoy your time with us, such as:</p>\n<ul>\n<li>Fully remote working - no more stressful commutes, ever</li>\n<li>Flexibility with working hours</li>\n<li>Regular virtual team activities</li>\n<li>An open, dynamic and collaborative digital working culture</li>\n</ul>\n<p>Interested? Apply now to submit your CV:</p>\n<h1><a href=\"https://apply.workable.com/bit-zesty/j/D8336DB20F/\">https://apply.workable.com/bit-zesty/j/D8336DB20F/</a></h1>\n<p>Due to the remote nature of this job, we have advertised it in different locations. Please only apply once.</p>\n<p>Bit Zesty is committed to being an equal opportunities employer and we welcome applicants from all backgrounds.</p>\n",
        "how_to_apply": "<p><a href=\"https://apply.workable.com/bit-zesty/j/D8336DB20F/\">https://apply.workable.com/bit-zesty/j/D8336DB20F/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXlhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--294f9e38426b93897521db1de552e69a97041218/8DRWUJcV_400x400%20(1).jpg"
    },
    {
        "id": "0da14936-394d-424c-a089-862665eb52a8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0da14936-394d-424c-a089-862665eb52a8",
        "created_at": "Thu Feb 25 10:12:14 UTC 2021",
        "company": "madewithlove",
        "company_url": "https://madewithlove.com",
        "location": "Amsterdam",
        "title": "Full-stack engineer (f/m/x)",
        "description": "<p>Our client is currently looking for a full-time and experienced full-stack engineer (f/m/x) that will be joining an exciting Amsterdam-based startup lead by ex-Uber and ex-Facebook employees. You will be developing the product from the ground up, while working according to the latest standards and you take pride in delivering nothing but high-quality PHP (Laravel) and React code, and know your way around in tooling and APIs.</p>\n<h2>What will you be doing?</h2>\n<ul>\n<li>You will be writing modern PHP and Javascript code while understanding that continuous refactoring is part of the job. You have a critical and pragmatic approach to guard over the quality of the code.</li>\n<li>You review the technical architecture of the platform and make the right choices on technologies we should (not) use.</li>\n<li>You'll be responsible for implementing automatic testing because you understand it’s an integral part of delivering high-quality features.</li>\n<li>You collaborate with a small team of top-notch engineers and aim to improve others as much as yourself.</li>\n<li>You implement and maintain development processes.</li>\n</ul>\n<h1>Requirements</h1>\n<p>!! Don't hesitate to apply if you don't fulfil 100% of the requirements. Superheroes don't exist, people with passion and talent do.</p>\n<h2>Soft skills</h2>\n<ul>\n<li>You like working in a startup environment and you have some affinity with the health and beauty industry. You can manage your own time and you are flexible enough to go the extra mile if needed.</li>\n<li>You have at least 3 years of experience building software applications.</li>\n<li>You are able to give others honest, constructive and actionable feedback. Credit is assigned accurately and generously.</li>\n<li>You know where information can be found and actively search for it. You can think for yourself and challenge the information you find. You don't hesitate to ask questions because others know things you don't. You document everything and in such a way that everybody can understand what is happening and why.</li>\n<li>Although you can work independently and efficiently, you like to work in a team environment. Once a group decision is made, you act as a team member by following the architecture, the processes and coding standards as agreed upon.</li>\n<li>You do what you promise and you take ownership of tasks. You always try to go for the best quality possible with respect to timing and budget. You understand the why of decisions and you suggest improvements when you see an opportunity.</li>\n<li>You always aim for quality so you actively and consistently strive to expand your knowledge, both technical and non-technical. You like sharing your knowledge with colleagues and the world through different channels (blogging, presentations, group discussions, ...).</li>\n<li>You can communicate clearly, taking into account who your audience is. You are always honest, sometimes brutally so, but you are aware of the situation and always stay polite. You know which is the right channel for each message or question.</li>\n</ul>\n<h2>Hard skills</h2>\n<ul>\n<li>You are a PHP/Laravel expert with a good understanding of React, or the other way around</li>\n<li>You know how to handle state, routing &amp; side-effects with React.</li>\n<li>You have experience setting up tooling for a modern web app.</li>\n<li>You have experience setting up infrastructure (e.g. DigitalOcean, Amazon Web Services)</li>\n<li>You have experience building RESTful APIs</li>\n<li>You like to make an impact and are keen to translate designs (Figma) into code</li>\n<li>You are keen on quality assurance and automatic testing</li>\n<li>Proper coding architecture is what makes you happy (e.g. MVC, SOLID).</li>\n<li>Version control (e.g. Git) is something you can't do without</li>\n<li>Although we like accents, your English must be very good, both oral and written</li>\n</ul>\n<h2>Bonus points</h2>\n<ul>\n<li>You have experience building mobile applications</li>\n<li>You have something valuable to add when discussing the product, UX and/or UI.</li>\n<li>You have an affinity with machine learning.</li>\n<li>You have experience setting up CI/CD pipelines (e.g. GitHub Actions)</li>\n<li>You are familiar with Shopify.</li>\n<li>Vous pouvez vous exprimer dans la langue de Molière</li>\n</ul>\n<h2>What you will be offered</h2>\n<ul>\n<li>A remuneration in accordance with the Dutch startup market</li>\n<li>Flexible working conditions</li>\n<li>25 paid holidays</li>\n</ul>\n<h1>The strengths of a good mix</h1>\n<p>We specifically encourage underrepresented groups to apply. We believe in the strengths of well-balanced, and mixed teams and hope our applications will attract a broader audience, no matter the gender, religion, race, age, disability, linguistic differences, socioeconomic status, or sexual orientation. Read more about our efforts towards a more inclusive and diverse environment.</p>\n<p>Hope to speak soon!</p>\n",
        "how_to_apply": "<p>Apply to our open positions via this URL: <a href=\"https://madewithlove.com/jobs/\">https://madewithlove.com/jobs/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVdhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a2bd45ce3d759fa8f190678e8b8f5467059a6629/mwl-logo-square.png"
    },
    {
        "id": "6c320d8d-0b56-4b1a-b1ee-c6861d889bc4",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6c320d8d-0b56-4b1a-b1ee-c6861d889bc4",
        "created_at": "Thu Feb 25 05:23:35 UTC 2021",
        "company": "Solv",
        "company_url": "http://www.solvhealth.com",
        "location": "Remote/San Francisco",
        "title": "Full-stack Technical Lead - React",
        "description": "<p>We’re hiring an engineering technical lead to help Solv build something that matters - directly impacting the way people interact with their healthcare provider.  This is a player/coach role where you will be building and leading a passionate, high-performing full-stack engineering team as well as on-going mentorship and coaching.  You’ll work closely with senior leadership to develop the best strategies, initiatives, and direction for the engineering team as we continue to grow.</p>\n<p>You can expect to:</p>\n<p>Technically lead a diverse and inclusive team of full-stack engineers working on building Solv’s platform</p>\n<p>Provide hands-on mentorship and support for the team to ensure there is positive growth towards personal and professional goals</p>\n<p>Collaborate with Engineering and Product teams on overall product roadmap, product launches, and other ongoing projects</p>\n<p>Develop and foster an inclusive, innovative environment where teams can be successful</p>\n<p>You'll be great for this role if:</p>\n<p>You have 5+ years experience building, shipping, and maintaining a framework-based JavaScript application using React/Redux</p>\n<p>Have experience working with React Hooks</p>\n<p>Have worked with Typescript</p>\n<p>Experience creating and maintaining a simple, well-organized CSS</p>\n<p>Worked as a full stack developer as well as in the backend with Python and Postgres (or similar)</p>\n<p>1-2 years leading a team of software engineers</p>\n<p>Committed to building diverse, inclusive teams</p>\n<p>Successful track record of creating empowering and collaborative team environments where engineers produce their best work</p>\n<p>Clear understanding of business metrics/KPIs and are able to identify areas of opportunity to increase business impact and growth</p>\n",
        "how_to_apply": "<p>Send your resume to:</p>\n<p><a href=\"https://jobs.lever.co/solvhealth/f55f68c5-10a1-49db-9498-ed2c36fd498f?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/solvhealth/f55f68c5-10a1-49db-9498-ed2c36fd498f?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUNhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c9b9894bf0075a4a7ec1973c70d1043748467ed1/Solv%20logo.png"
    },
    {
        "id": "6f9a26a3-d539-402e-8a05-a0ff41dc4e53",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6f9a26a3-d539-402e-8a05-a0ff41dc4e53",
        "created_at": "Wed Feb 24 22:52:22 UTC 2021",
        "company": "Dwell",
        "company_url": "http://dwell.com",
        "location": "Remote (US Only)",
        "title": "Senior Frontend Engineer",
        "description": "<p>Dwell has been a champion of good design for two decades. Our mission is to foster appreciation for how great spaces can transform lives and communities.﻿</p>\n<p>We reach 40 million people every year primarily by publishing content that brings attention to original efforts to make architecture more sustainable and accessible.﻿</p>\n<p>As a senior frontend web developer, you will collaborate within a cross-functional product team to devise and implement solutions that meet strategic objectives. Your unique responsibility within this team will be UI development and engineering.</p>\n<p>The product team is entrepreneurial, creative, personable, and fundamentally committed to building products and services that are best in class in design and execution. You will be a great fit if you’re self-motivated, organized, and multi-task well. You enjoy problem-solving and are always learning new skills.</p>\n<h3><strong>What You’ll Do</strong></h3>\n<ul>\n<li>Lead all frontend web development efforts</li>\n<li>Translate designs—rough sketches, wireframes, refined visual designs, interactive prototypes, and/or user stories—into well-crafted interfaces</li>\n<li>Plan, estimate, and build new features</li>\n<li>Ensure a high level of quality and performance</li>\n<li>Troubleshoot and debug as issues arise</li>\n<li>Refine and evolve our front-end web stack</li>\n<li>Collaborate closely with product, design, and back-end engineers by contributing to initial ideation and throughout implementation and iteration</li>\n<li>Generously share your knowledge and expertise through demos, presentations, mentoring, and code reviews</li>\n<li>Value feedback and constructive criticism</li>\n</ul>\n<h3>We Currently Use</h3>\n<ul>\n<li>ES6+</li>\n<li>React</li>\n<li>Redux</li>\n<li>SCSS</li>\n<li>Mocha</li>\n<li>webpack</li>\n</ul>\n<h3>What We’re Looking For</h3>\n<ul>\n<li>Enthusiastic and self-motivated</li>\n<li>Ability to learn quickly and adapt in a fast-paced environment</li>\n<li>Deep understanding of HTML, CSS, JavaScript, and responsive web design</li>\n<li>Extensive experience translating designs into well-crafted code</li>\n<li>Experience working with service-oriented architecture</li>\n<li>Experience with React or similar</li>\n<li>Experience building digital subscription products</li>\n<li>Excellent problem-solving and organizational skills</li>\n<li>Excellent communication skills</li>\n<li>B.A., B.S., or equivalent experience</li>\n</ul>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://careers.dwell.com/p/c0dfbf98fec9-senior-frontend-engineer\">https://careers.dwell.com/p/c0dfbf98fec9-senior-frontend-engineer</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDZhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e4fa4e28b4b767e38653f0e6755dcb2415cd5cc1/Dwell%20Logo.png"
    },
    {
        "id": "3457db5f-c67e-4352-a999-c8505f7acb4e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3457db5f-c67e-4352-a999-c8505f7acb4e",
        "created_at": "Wed Feb 24 21:21:28 UTC 2021",
        "company": "DSPolitical",
        "company_url": "http://www.dspolitical.com",
        "location": "Washington, DC 20005, USA",
        "title": "Front End Engineer I",
        "description": "<p>DSPolitical is hiring for a Front End Engineer to further solidify DSPolitical as the leader in targeted advertising for progressive digital campaigns by growing our presence in the market. </p>\n<p>Who Are We?  </p>\n<p>DSPolitical pioneers the best integration of data and technology to persuade audiences and deliver wins for progressive candidates, causes, issues with the most efficient and effective digital advertising campaigns in politics and issue advocacy. </p>\n<p>DSPolitical doesn’t just offer solutions -- we create them. Our team works hand-in-hand to develop and deploy leading-edge solutions, uniquely crafted to reach the audiences our clients need to be successful in both the public affairs and political arena.</p>\n<p>About the Position</p>\n<p>The Front End Engineer provides support to the Director of Engineering and Technology team. Works on the code base for the DSPolitical platform. Works to develop new product offerings and enhance existing offerings. Is able to ensure work is bug-free. </p>\n<p>Specific duties may include the following:</p>\n<p>Implement new features in the front end of DSPolitical's web applications.\nParticipate in the design process to steer feasibility and provide design input.\nHelp maintain existing software.\nCollaborate with team members to write code and problem solve.\nEnsure that the user experience of DSPolitical's products feels modern and fresh.\nProvide Tier-1 trouble shooting.\nMaintain confidentiality and professionalism.</p>\n<p>Essential Attributes &amp; Experience</p>\n<p>1+ years of experience in front end web application development.\nStrong experience with JavaScript, with modern reactive frameworks, preferably Vue.js.\nExperience interfacing with REST APIs, and UI/UX Design Theory.\nExperience with CSS preprocessors such as SCSS or SASS.  Some experience designing wireframes or mock-ups in Sketch or XD is a plus\nExperience with version control systems, particularly Git.\nThe Development Team is small and highly collaborative. Responsibilities can and will shift to some degree based on business needs, aptitude, and interest. The ability and interest to rapidly learn new skills and technologies is crucial. \nDue to legal requirements of campaign ads, US work authorization is required.</p>\n<p>DSPolitical is proud to offer: </p>\n<p>Base salary between $60,000 - $80,000 annually and commensurates with experience \nUnlimited leave (paid time off)\n100% employer-paid health insurance for employees (including dental and vision)\nFlex Spending Plan\nEmployee Assistance Program\n401K with company matching\nStudent Loan Repayment Program\nProfessional development opportunities\nRewards and recognition programs\nMobile phone &amp; internet reimbursement and much more!</p>\n<p>Office Hours</p>\n<p>Work hours are consistently 10:00 a.m. to 6:00 p.m. Monday – Friday, with the expectation that evening and weekend work will be required as necessary. Due to COVID-19, this position is temporarily remote for the 2021 year. </p>\n<p>DSPolitical works hard to provide our clients with innovative solutions based on the diverse perspectives of our team. To that end, we’re committed to recruiting team members from a wide range of backgrounds and experiences. DSPolitical is an equal opportunity employer. We encourage applicants of all races, colors, gender identities, religions, ages, sexual orientations, national and ethnic origins, disabilities, marital status, veteran status and all backgrounds. </p>\n<p>DSPolitical job offers are contingent on the results of a background check.</p>\n",
        "how_to_apply": "<p>To apply, submit an application at dspolitical.com/careers/</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHFhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a247320561011a8a6f5e1c95ef05d8118ece64a9/DSP-logo-b.png"
    },
    {
        "id": "ef15da6b-5d13-4c2b-942a-ec3ea02b608e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ef15da6b-5d13-4c2b-942a-ec3ea02b608e",
        "created_at": "Tue Feb 23 09:37:10 UTC 2021",
        "company": "Wallet.Services",
        "company_url": "https://siccar.net/",
        "location": "Edinburgh",
        "title": "Front End Developer (HTML/CSS/JS)",
        "description": "<p><strong>Front End Developer (HTML/CSS/JS)</strong></p>\n<p><strong>About Us</strong></p>\n<p>SICCAR aims to connect and protect business and society. SICCAR enables organisations to share sensitive data through one trustworthy digital platform. Our platform addresses data sharing problems during interactions between citizens and government bodies.</p>\n<p>SICCAR adopts distributed ledger technology (DLT), to deliver a cyber secure platform for organisations to collaborate on secure reliable data. SICCAR facilitates secure data sharing where data security, protection, integrity and governance are required.</p>\n<p><strong>About the Job</strong></p>\n<p>We're looking for an enthusiastic and keen Front End Developer to join us and help make the digital world safer and more efficient with software that provides streamlined and secure digital process.</p>\n<p>The post is a key member of the development team who will:</p>\n<ul>\n<li>work closely with our in-house UI/UX designer and implement their design into front end apps;</li>\n<li>take the existing front end resources and own them with a view of open sourcing them;</li>\n<li>liase with customers and clients to understand their needs;</li>\n<li>be data driven when it comes to the apps and their development.</li>\n</ul>\n<p><strong>About You</strong></p>\n<p>Suitable candidates with approximately 3 years of the following experience:</p>\n<ul>\n<li>HTML 5, CSS with a demonstrable portfolio.</li>\n<li>Any client-side JavaScript technologies such as web components (Angular, React, VueJS etc.).</li>\n<li>JSON, RESTful APIs.</li>\n<li>Front end testing frameworks (Jasmine/Mocha).</li>\n<li>Knowledge and experience of applying engineering principles and practices for design, build, test and deployment.</li>\n<li>Experience with DevOps and continuous integration.</li>\n<li>Committed to high quality, clean code.</li>\n<li>Excellent communication skills with the ability to build effective working relationships with stakeholders at all levels.</li>\n<li>Solid understanding of design principles, a creative mind and an eye for detail.</li>\n</ul>\n<p>It would be great if you could provide a portfolio where you can show:</p>\n<ul>\n<li>Examples of where you have implemented someone elses design.</li>\n<li>Examples of where you have worked on your own but also as part of a team.</li>\n<li>Examples of where you have implemented data driven analytics and made appropriate changes.</li>\n</ul>\n<p><strong>Salary and Benefits:</strong></p>\n<ul>\n<li>Remote working with full flexibility.</li>\n<li>A competitive salary that reflects your experience and merit.</li>\n<li>Pension contributions.</li>\n<li>A discretionary equity-based incentive plan.</li>\n<li>An employee referral program.</li>\n<li>Cyclescheme, Techscheme.</li>\n</ul>\n<p><strong>Are you up for the challenge?</strong></p>\n<p>Apply now via the <a href=\"https://ltpx.nl/goVKRPS\"><strong>application form</strong></a>.</p>\n<p><em>Agency calls are not appreciated.</em><img src=\"https://camo.githubusercontent.com/560cc004c0ed992a6df2c95d38ed4e0ae76a7d6b/68747470733a2f2f742e6c7470782e6e6c2f747261636b2e7068703f6f7264657269643d323335383136\"></p>\n",
        "how_to_apply": "<p><a href=\"https://ltpx.nl/WHSCsYD\">Click here to apply</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaldhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f0d703dee8c5e708b0d0dabbf74a63d52c8087c2/Wallet%20(23)%20(1).jpg"
    },
    {
        "id": "a1e97063-0782-497a-a821-9c6ffbb0d7e9",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a1e97063-0782-497a-a821-9c6ffbb0d7e9",
        "created_at": "Tue Feb 23 00:36:22 UTC 2021",
        "company": "WW",
        "company_url": null,
        "location": "New York",
        "title": "Fullstack Product Engineers (Mid - Senior Levels) Remote",
        "description": "<p>WW is looking for candidates to help change people’s lives. We are a global wellness technology company inspiring millions of people to adopt healthy habits for real life. We do this through engaging digital experiences, face-to-face workshops, and sustainable programs that encourage people to move more, shift their mindset, and eat healthier while enjoying the foods they love. By drawing on over five decades of experience and expertise in behavioral science, we build communities in order to deliver wellness for all.</p>\n<p><strong>Role Overview:</strong></p>\n<p>To help us achieve our goals, we are seeking a Senior Software Engineer to join our team. You will leverage your knowledge to develop new consumer-focused products using modern Engineering such as Agile development, Continuous Integration, and Deployment, Microservices, etc. As a Senior Software Engineer at WW, your code, designs, and decisions will be highly visible, and will directly impact and delight our users.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Program daily in Node.js, Express, React, GraphQL, MongoDB, PostgreSQL, and others</li>\n<li>Build out restful endpoints and lightweight aggregation layers</li>\n<li>Build out new features and iterate on existing features</li>\n<li>Design and implement low-latency, high-availability, and performance applications</li>\n<li>Help define architectures and design patterns</li>\n<li>Participate in code reviews</li>\n<li>Answer technical inquiries on codebase and product requirements</li>\n<li>Lead the way with writing programmatic unit and integration tests</li>\n<li>Work closely with tech leads, product managers, and design teams</li>\n<li>Full responsibility for developing, testing, and deploying using our ci/cd tools</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Real world web and service development experience</li>\n<li>Deep experience with content modeling</li>\n<li>Experience with modern frameworks such as React, Node.js, Express</li>\n<li>Experience with web services API integration (GraphQL, Rest, JSON, XML)</li>\n<li>Experience with responsive HTML &amp; CSS frameworks such as bootstrap</li>\n<li>Understanding of general user experience and UI design principles</li>\n<li>Ability to understand requirements and map to technical implementation</li>\n<li>Relational and/or NoSQL database experiences such as MySQL, Postgres, or Mongodb</li>\n<li>Solid foundation in data structures, algorithms, and software design</li>\n<li>Strong track record of shipping products</li>\n<li>Knowledge of streaming services like Kafka or Kinesis will be a huge plus</li>\n<li>Experience with Continuous Integration/Continuous Delivery (CI/CD). Github Actions will be a plus</li>\n<li>Proficient understanding of code versioning tools such as GIT, SVN, etc</li>\n<li>Experience with Docker and Amazon Web Services a plus</li>\n<li>Experience with open source Content Management Systems such as Drupal, WordPress, Keystone are all pluses</li>\n<li>Experience with Swagger/OAS documentation a huge plus</li>\n<li>Experience in mentoring and leading other Engineers</li>\n<li>Computer science degree or equivalent academic or professional background</li>\n</ul>\n<p><em>WW is an equal opportunity employer. WW does not discriminate on the basis of sex, race, color, creed, national origin, marital status, age, religion, sexual orientation, gender identity, gender expression, veteran status, or disability.</em></p>\n",
        "how_to_apply": "<p><a href=\"https://ww.wd1.myworkdayjobs.com/careers/job/New-York-Remote/Fullstack-Software-Engineer---Remote--Mid---Senior-Levels-_R210000001342?source=GitHub\">Apply Here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakNhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2f1688b9e20418697e1397703b0d796122dd7df4/WW%20Logo.png"
    },
    {
        "id": "07d9afe8-0916-40f5-a508-2a42d9dc6c98",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/07d9afe8-0916-40f5-a508-2a42d9dc6c98",
        "created_at": "Mon Feb 22 16:45:45 UTC 2021",
        "company": "brightwheel ",
        "company_url": "https://mybrightwheel.com/careers/",
        "location": "Anywhere in the US",
        "title": "Senior Software Engineer, Backend",
        "description": "<p>Our Mission and Opportunity\nEarly education is one of the greatest determinants of childhood outcomes, is a must for working families, and has lasting social and economic impact. Brightwheel’s mission is to transform early education for every teacher, child, and parent — by giving teachers meaningfully more time with students each day, engaging parents in the development of their kids, and supporting the small businesses that make up the backbone of the $100 billion early education market. Brightwheel is the most loved technology brand in early education globally, trusted by thousands of educators and millions of families.</p>\n<p>Our Team\nWe are a distributed team, with offices in San Francisco, Denver, and Austin along with fully remote team members. Our team is passionate, talented, and customer-focused. Our exceptional investor group includes Addition, Bessemer Venture Partners, Chan Zuckerberg Initiative, GGV Capital, Lowercase Capital, Emerson Collective, and Mark Cuban.</p>\n<p>We believe that everyone—from our employees to the students, teachers, and administrators we serve— should be given the opportunity to learn and thrive, whatever their background may be. We celebrate diversity in all forms because it allows our team and the communities we serve to reach their full potential and do their best work.</p>\n<p>Who You Are\nWe are seeking a senior software engineer who is not only well-rounded technically, but also someone who is passionate about the positive impact their code can make in people's lives. Brightwheel engineers work closely with product and design, as well as with other areas of the business to deliver a platform that meets our teachers’ &amp; parents’ biggest needs. Every engineer at brightwheel is afforded a high degree of ownership and autonomy. We are a lean, fast-moving team and value individuals who can optimize for being impactful while considering both technical and business drivers.</p>\n<p>What You'll Do\n-Work alongside product and design to scope and implement new features or product lines.\n-Be a steward of quality, scalability, security, and performance. You'll work with other engineers to ensure that we have a solid foundation that serves our customers, and enables the team to continue building a great product.\n-Design and architect new software systems, or introduce new technologies, as appropriate to support brightwheel’s growth.\n-Share knowledge and expertise across the engineering team</p>\n<p>Qualifications, Skills, &amp; Abilities\n-4+ years of professional experience, preferably in dynamic companies/teams\n-Expertise in one or more application programming languages (e.g Ruby, JavaScript or Python)\n-Proficiency in building and debugging distributed systems on AWS\n-Proficiency in both contributing to and designing APIs</p>\n<p>Candidates with varying backgrounds are encouraged to apply. We do not require prior knowledge of technologies in our stack, only a desire to learn them. At brightwheel you will encounter:</p>\n<ul>\n<li>React.js</li>\n<li>Ruby on Rails</li>\n<li>PostgreSQL</li>\n<li>Redis</li>\n<li>CircleCI</li>\n<li>Kubernetes</li>\n<li>AWS managed services, like Redshift and ECS</li>\n</ul>\n<p>Brightwheel is proud to celebrate diversity and is committed to building an inclusive workplace regardless of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.</p>\n",
        "how_to_apply": "<p>Please apply using the link below:</p>\n<p><a href=\"https://jobs.lever.co/brightwheel/6e96774f-8350-495d-a567-c7eba55f171d?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/brightwheel/6e96774f-8350-495d-a567-c7eba55f171d?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHlhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8665ccd64baddd8e0766413744ed285dbe693bf1/Logo%20.png"
    },
    {
        "id": "89d965b5-4f4d-4f94-abac-76fe67e123ac",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/89d965b5-4f4d-4f94-abac-76fe67e123ac",
        "created_at": "Mon Feb 22 16:16:34 UTC 2021",
        "company": "smartmicro",
        "company_url": "https://www.smartmicro.com",
        "location": "Braunschweig, Brunswick",
        "title": "Backend Developer for Smart City Sensors (m/f/d)",
        "description": "<p>Join the smartmicro team to shape the road towards a greener future of our cities ​by providing scalable and robust backends for web-based communication and web apps.</p>\n<p>The smart sensors ranging from radars over hybrids of cameras and radars to complete smart city systems improving traffic flow and thus reducing pollution.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>As a backend developer you are responsible for the implementation on embedded devices</li>\n<li>You will support the use of the systems with regard to Development &amp; Operations (Dev / Ops)</li>\n<li>You test the software to ensure responsiveness and efficiency, especially considering the limited resources of embedded systems</li>\n<li>You will work with front-end developers to integrate user-side elements with server-side (embedded system) logic</li>\n<li>You ensure that external service providers are connected by programming REST APIs</li>\n<li>To ensure our software quality, you regularly perform debugging and code reviews</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Completed degree in computer science or a similar qualification</li>\n<li>You are familiar with the concept of continuous delivery for deployment and integration as well with the topics of IT security, server administration (Linux / nginx)</li>\n<li>Experience with databases (e.g. MySQL), web servers (e.g. Apache, NGINX)</li>\n<li>Ideally, you are familiar with JavaScript, web frameworks - e.g. B. Vue.js, React or Angular</li>\n<li>Practical experience with programming languages, especially Python and JavaScript frameworks (e.g. Django, React, Node.js)</li>\n<li>Experience with REST APIs, unit testing, microservices, Docker, Git, Linux and Jira is desirable</li>\n<li>Clean code mentality</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Great development projects in strongly growing markets</li>\n<li>Opportunities to develop your career in a fast-moving company</li>\n<li>Latest technology</li>\n<li>Great working environment and a highly motivated team</li>\n<li>Spacious offices and labs in very modern company buildings</li>\n<li>Fitness training, corporate functions and much more on company expenses</li>\n<li>Openness for innovation, teamwork and zero bureaucracy</li>\n</ul>\n<p>Be part of our innovative team and help us expanding the leadership in Radar- and camera sensor technology. Please send your application here or via email.</p>\n",
        "how_to_apply": "<p><a href=\"https://smartmicro.join.com/jobs/1898784-backend-developer-for-smart-city-sensors-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=backend%2Bdeveloper%2Bfor%2Bsmart%2Bcity%2Bsensors%2Bm%2Bf%2Bd\">https://smartmicro.join.com/jobs/1898784-backend-developer-for-smart-city-sensors-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=backend%2Bdeveloper%2Bfor%2Bsmart%2Bcity%2Bsensors%2Bm%2Bf%2Bd</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--33afdfe38140a216f318df6358ed858cb8f7c2f7/smartmicro-logo-l.jpg"
    },
    {
        "id": "9b8ee13b-8372-4063-bd9f-08d12f44cb16",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9b8ee13b-8372-4063-bd9f-08d12f44cb16",
        "created_at": "Mon Feb 22 15:58:42 UTC 2021",
        "company": "Braintrust",
        "company_url": null,
        "location": "Remote",
        "title": "Fullstack Engineer - Ruby on Rails/React [Remote, NO C2C]",
        "description": "<p>JOB TYPE: Freelance, Contract Position - No agencies (See notes below)</p>\n<p>LOCATION: Remote (must overlap with PT timezone 3 hours per day)</p>\n<p>HOURLY RANGE: Our client is looking to pay $60 - $80 USD / HR</p>\n<p>ESTIMATED DURATION: 40Hrs/Week - Long Term, ongoing project</p>\n<p>HIGH-LEVEL QUALIFICATIONS:</p>\n<ul>\n<li>\n<p>Ruby</p>\n</li>\n<li>\n<p>React</p>\n</li>\n<li>\n<p>JavaScript</p>\n</li>\n<li>\n<p>Familiarity with React Native as a bonus point</p>\n</li>\n</ul>\n<p>ABOUT US:</p>\n<p>Braintrust (usebraintrust.com) is a user-controlled talent network, where you keep 100% of what you earn and actually get to own the platform. We've been onboarding some big clients and specifically need a Fullstack Engineer for our client.</p>\n<p>THE OPPORTUNITY:</p>\n<p>As a senior software engineer (full-stack) on the engineering team, you’ll get to build features and improvements for our client's web platform. You’ll be one of the leaders of the team, helping to mentor more junior engineers, proposing creative solutions, de-tangling the complex into the simple, and collaborating closely with teammates across product and engineering.</p>\n<p>The engineering team uses React.js on the web frontend, React Native for the mobile applications, and Ruby on Rails on the backend. We’re looking for people who are comfortable and interested in working with a little bit of everything.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Build out software features to support clients, taskers, and internal users</li>\n<li>Architect and craft solutions to complex problems</li>\n<li>Collaborate with design and product management to conceptualize new product features from the ground up</li>\n<li>Work alongside more junior software engineers to help them think through designs, code implementation, and how to break down their goals into actionable steps</li>\n<li>Participate in code reviews, listening to feedback and commenting on other's approaches</li>\n<li>Maintain and expand upon existing code and functionality</li>\n</ul>\n<p>Qualifications:</p>\n<ul>\n<li>5+ years of experience developing web applications</li>\n<li>You're comfortable with Ruby and Rails, Javascript, and React.js (React Native is a plus)</li>\n<li>You have built API-driven applications or endpoints</li>\n<li>You're excited about continuous integration and frequent, daily releases</li>\n<li>Understand how to organize code across the stack, what belongs in the front end, what the back</li>\n<li>Know how to break problems down into smaller iterable steps achievable quickly</li>\n<li>Be comfortable with caching and understanding full lifecycle behavior of data flowing through the system</li>\n<li>You are comfortable with an Agile work environment where you’ll be collaborating regularly with Product, Design, Data, QA, and other developers regularly</li>\n</ul>\n<p>ABOUT THE HIRING PROCESS:</p>\n<p>Qualified candidates will be invited to do a screening interview with the Braintrust staff. We will answer your questions about the project, and our platform.  If we determine it is the right fit for both parties, we'll invite you to join the platform and create a profile to apply directly for this project.</p>\n<p>C2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.</p>\n<p>Braintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.</p>\n",
        "how_to_apply": "<p><a href=\"https://jsco.re/9fdqx\">https://jsco.re/9fdqx</a></p>\n",
        "company_logo": null
    },
    {
        "id": "9c353576-5bb0-47ce-89ae-3b5bf99cea6e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9c353576-5bb0-47ce-89ae-3b5bf99cea6e",
        "created_at": "Mon Feb 22 14:07:12 UTC 2021",
        "company": "Propelor",
        "company_url": "https://www.propelor.com/",
        "location": "Remote",
        "title": "Senior Ruby Developer (Remote)",
        "description": "<p>Investing is commission free. Now what? There are +100 million brokerage accounts in the US and while it’s easier than ever to invest, it’s still too hard to set up and track a quality investment strategy yourself. This is where Propelor comes in.</p>\n<p>Propelor is an AI for the self-directed investment management industry that makes it easier to manage a portfolio. Based on what the investor owns and our proprietary data-sets, we can help investors save time researching while also managing risk and planning for income.</p>\n<p>We are looking for a Senior Developer to join our core product team.  <strong>If you want to build the AI for brokerage accounts and have solved hard technical challenges with ruby, please apply via <a href=\"https://www.linkedin.com/jobs/view/2255010679/\">LinkedIn</a> or send an email directly to our CTO Haifeng Cao (<a href=\"mailto:haifeng.cao@propelor.com\">haifeng.cao@propelor.com</a>).</strong></p>\n<h2>About The Role</h2>\n<p>At most companies, software developers follow routines like point tracking and grooming and are isolated from non-developers. At Propelor, we do things differently.</p>\n<p>We believe in the original spirit of Agile, but follow a more light-weight product approach called ShapeUp across an integrated team. We don’t believe in distinguishing between the “dev team,” “product team” or “business team”, instead, those responsible for building our products are on the “build team”. We give people more trust, flexibility and responsibility to get things done, not less.</p>\n<p>Each product cycle depends on having everyone aligned on what we want to build and how long it’s going to take. At that point, the build team self-organizes and manages their own schedules around the deliverable. We don’t get it right every time, but we find that giving people more control and freedom day-to-day leads to a better work life and more progress over time.</p>\n<p>As a Senior Developer you’ll be working within our microservices architecture, based on the Rails framework and work in 4-6 week product cycles. As an open source guru, you’ll design and implement new systems, introduce new technologies, make calls, take ownership of the code and get things done.</p>\n<p>You’re a developer at heart, but are also interested in the big picture and care a lot about users. You communicate clearly with colleagues, easily work across teams, and lend a helping hand when needed. You understand the importance of teamwork in building something bigger than yourself.</p>\n<p>Here are some things we’ve worked on recently to give you a sense of what you’ll be doing day-to-day:</p>\n<ul>\n<li>Leveraged the power of Ruby proc to build a flexible classification methodology for investment securities</li>\n<li>Integrated StimulusJS with Rails to power fast asynchronous responses to user’s investing behaviors</li>\n<li>Built an API that connected user generated data with the data management platform</li>\n<li>Customized a component of our ETL platform that aggregates complex financial data to improve maintainability and reliability</li>\n</ul>\n<h2>About Us</h2>\n<p>Propelor is a privately held company. We own a network of financial media sites that we use to launch new products, learn from users and harden our core technology. We’re a small team with big ambitions and offer top notch salaries with benefits (health, dental, vision).</p>\n<h2>Technology</h2>\n<ul>\n<li>Kubernetes</li>\n<li>Microservice</li>\n<li>Rails</li>\n<li>React</li>\n<li>CSS</li>\n<li>Docker</li>\n<li>Elasticsearch</li>\n<li>Graph Database</li>\n<li>Redis</li>\n<li>Git</li>\n<li>JSON</li>\n</ul>\n<h2>Social Skills</h2>\n<ul>\n<li>Entrepreneurial</li>\n<li>Natural leader</li>\n<li>Builder / Problem solver</li>\n<li>“Get things done” mentality</li>\n<li>Passion</li>\n<li>Excellent communication</li>\n<li>Team player</li>\n<li>Attention to detail</li>\n</ul>\n<p><a href=\"https://www.linkedin.com/jobs/view/2255010679/\">Click Here to Apply</a></p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:haifeng.cao@propelor.com\">haifeng.cao@propelor.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE9hIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9367d3a583438b32e17f21658bc71667ebbe06e0/1598632995051.jpeg"
    },
    {
        "id": "8bc7149f-9fd7-4ae1-812b-31bee77d1bba",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8bc7149f-9fd7-4ae1-812b-31bee77d1bba",
        "created_at": "Mon Feb 22 12:32:38 UTC 2021",
        "company": "azeti GmbH",
        "company_url": "https://www.azeti.net/",
        "location": "Berlin",
        "title": "Lead Developer - azeti IoT Platform",
        "description": "<p>Wir sind ein Berliner Internet of Things (IoT) Software Unternehmen. Unsere IoT Plattform ermöglicht es, einfach und schnell industrielle IoT Anwendungen umzusetzen. Bereits seit 2006 bieten wir Software „Made in Germany” für nationale und internationale Kunden an. Sowohl in Europa, Amerika als auch in China, sind unsere IoT-Lösungen im Einsatz. Als Spezialisten für Digitalisierung und IoT wird unsere TÜV-geprüfte IoT-Plattform bereits in verschiedensten Branchen eingesetzt. Diverse Forschungsprojekte und langjährige OEM-Partnerschaften in der Industrie unterstreichen unsere Kompetenz und Expertise zur Lösung anspruchsvollster IoT-Projekte. Mit unserer Open Source Edge Software und der brandneuen IoT Plattform gehen wir noch einen Schritt weiter und werden das Internet der Dinge für alle ermöglichen.</p>\n<p>Weitere Informationen über uns unter <a href=\"http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/2/YtLaNYO8H-VqgZJJuhLQ_w/aHR0cHM6Ly93d3cuYXpldGkubmV0\">www.azeti.net</a>.</p>\n<p><strong>Warum wir?</strong></p>\n<p>Diese seltsamen Zeiten verlangen uns allen viel ab. <strong>Wir bieten unserem Team ein sicheres und langfristiges Arbeitsumfeld und sind auf der Suche nach neuen Teammitgliedern, die unser Team für die nächsten Jahre ergänzen.</strong> Neben einem sicheren Geschäftsmodell, sind wir als Tochterunternehmen der Aurubis AG ein sicherer Arbeitgeber für Deine berufliche Zukunft.</p>\n<ul>\n<li><strong>Stabiles und sicheres Arbeitsumfeld</strong></li>\n<li>Flexible Arbeitszeiten und Rücksichtnahme auf Ihre familiären Belange (Homeschooling, Kinderbetreuung, etc.)</li>\n<li>Home-Office möglich mit regelmäßigen Fahrten (alle 4-6 Wochen) zu Workshops und Veranstaltungen in unserem Berliner HQ</li>\n<li>Freie Wahl der Hardware (Linux, Mac, Windows) und Ausstattung für Ihr Home Office</li>\n<li>Überdurchschnittliches Gehalt und tolle Entwicklungsmöglichkeiten</li>\n<li>Agiles Arbeiten in einem vielfältigen internationalen Team, flache Hierarchien</li>\n<li>Direkter Einfluss auf die Produktentwicklung mit sofortiger Wirkung für unseren Kundenstamm</li>\n<li>Erstklassiger Technologie-Stack mit spannenden Entwicklungen, die bereits in Arbeit sind</li>\n<li>\n<a href=\"http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/3/9DLcVbz8zz2GGtCENkt0Cw/aHR0cHM6Ly9jb3Jwb3JhdGUudXJiYW5zcG9ydHNjbHViLmNvbS9lbg\">Urban Sports Club-Mitgliedschaft</a>, vollständig von uns bezahlt</li>\n<li>Fahrrad-Leasing per <a href=\"http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/4/DjTuSZj6OpRmb9pgcU_gTw/aHR0cHM6Ly93d3cuYnVzaW5lc3NiaWtlLmRlL2Rl\">Business-Bike</a> oder <a href=\"http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/5/NR-efXq3OpjFC0op9Xm3Zw/aHR0cHM6Ly93d3cuam9icmFkLm9yZy8\">Jobrad</a>\n</li>\n<li>\n<a href=\"http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/6/XZxKFG6MjbrMadGHOsKT6w/aHR0cHM6Ly93d3cuY29ycG9yYXRlLWJlbmVmaXRzLmRlLw\">Corporate Benefits Programm</a> mit tollen Rabatten</li>\n<li>Kontinuierliches Lernen und 100 € <a href=\"http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/7/9I9q3pGcJqvMGJKESM0zxw/aHR0cHM6Ly93d3cudWRlbXkuY29tLw\">Udemy</a>-Budget pro Monat</li>\n</ul>\n<p><strong>Deine Aufgaben</strong></p>\n<p><strong>Um unsere IoT Platform auf das nächste Level heben zu können, sucht unser IoT Platform Team (6 Entwickler) nach einem erfahrenen Lead der als aktiver Entwickler durch technische Finesse, Agilität und Erfahrung führt.</strong> Gemeinsam mit dem Team entwickelst Du die Platform weiter und hast hierbei best practices und moderne Methoden im Fokus. Du inspirierst und spornst an durch Know-How und stellst den status quo in Frage. Hierbei wirst Du ca. 80% als Fullstack Entwickler arbeiten und 20% für Führungsaufgaben aufbringen, somit bist Du nah am Produkt und aktiver Teil der Entwicklung.\nDu stellst dich mit dem Team den nächsten großen Herausforderungen (k8s, CI/CD, end-to-end Testing, Kafka uvm.) und hilfst durch agile Heransgehensweise auch schwierige Anforderungen gemeinschaftlich zu meistern.\nUns ist wichtig das Du als Team Lead auf Augenhöhe führst und durch deine Expertise und Erfahrung inspirierst und hier als Experte ein zentraler Teil des Teams bist.</p>\n<p><strong>Des Weiteren umfasst deine Rolle:</strong></p>\n<ul>\n<li>Kommuniziere Best Practices und Qualitätsansprüche klar und kontinuierlich</li>\n<li>Pair Programming, Code Reviews sowie Supervision unserer Architektur und der Backlog gemeinsam mit Product Owner</li>\n<li>Thematische Organisation regelmäßiger Workshops und Trainings, bei der Logistik hilft dir unsere nette Team-Assistenz</li>\n<li>Enge Zusammenarbeit mit Scrum Master und Product Owner um sicherzustellen, dass das Team eng zusammenarbeiten kann und es keine Blocker gibt</li>\n<li>Teamkollegen anleiten, führen und inspirieren, um ein gesundes, hochkarätiges Entwicklungsteam zu schaffen</li>\n<li>Finde pragmatische und agile Lösungen, beginnen mit Rapid Prototyping und iteriere in Richtung MVP's mit konstanten Feedbackschleifen, Tests und Zusammenarbeit</li>\n<li>Hinterfrage Anforderungen und berate, um pragmatische Lösungen zu finden und stets einen Kundennutzen zu liefern</li>\n<li>Regelmäßige Kommunikation mit Stakeholdern und dem erweiterten Kollegium</li>\n</ul>\n<p><strong>Place of Work</strong></p>\n<p>Wir arbeiten derzeit komplett remote und glauben an flexible Arbeitsvereinbarungen. Du kannst die meiste Zeit aus dem Home-Office arbeiten. Unser Ziel ist es, das Team alle 4-6 Wochen in unserem Büro für Workshops und Veranstaltungen zu versammeln.</p>\n<p><strong>Deine Rolle wird insbesondere Mentoring deiner Kollegen beinhalten, daher ist es von großem Vorteil, wenn Du nah an oder in Berlin wohnst.</strong></p>\n<p><strong>Dein Profil</strong></p>\n<ul>\n<li><strong>Mindestens 2 Jahre praktische Erfahrung in der Führung eines agilen Software-Teams</strong></li>\n<li>Agiler Arbeitsansatz, der ständige Iteration und Zusammenarbeit beinhaltet</li>\n<li>Du sprichst fließend Englisch, <strong>Deutsch Sprachkenntnisse sind ein großes Plus</strong>\n</li>\n<li>Sehr gute Kommunikationsfähigkeiten, mündlich und schriftlich starke Präsentationsfähigkeiten</li>\n<li>Erfahrung in der Entwicklung in agilen Umgebungen (Scrum, Kanban)</li>\n<li>Hohes Maß an Eigenorganisation und aktive Kommunikation</li>\n<li><strong>Umfangreiche Erfahrung in der Entwicklung von Microservices Applikation</strong></li>\n<li><strong>Umfangreiche Erfahrung mit Spring Framework in Java oder Kotlin</strong></li>\n<li>Erfahrung Umgang mit Functional Components ReactJS und TypeScript</li>\n<li>Erfahrung und Interesse an Datenvisualisierung und Dashboarding sind ein Plus</li>\n<li>Erfahrung in der Entwicklung Event getriebener Applikationen ist ein Plus</li>\n<li>Erfahrung mit Kafka ist ein Plus</li>\n</ul>\n<p><strong>Wenn Du in der Nähe von Berlin lebst, ist das ein großes Plus.</strong></p>\n<p><strong>Kontakt</strong></p>\n<p>Bitte ]bewirb dich über unsere Karriereseite](<a href=\"http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/8/cIpHNaAls0r986HOZpNRIQ/aHR0cHM6Ly9hemV0aS5qb2JzLnBlcnNvbmlvLmRlLw\">http://t3u1.mjt.lu/lnk/AMcAAEo_L1gAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgMA9zaKDBJUTkTSCTdbhAfs4ZZwAGCXo/8/cIpHNaAls0r986HOZpNRIQ/aHR0cHM6Ly9hemV0aS5qb2JzLnBlcnNvbmlvLmRlLw</a>) oder sende deine Unterlagen an <a href=\"mailto:career@azeti.net\">career@azeti.net</a>. Dein Ansprechpartner ist Sebastian Koch.</p>\n<p><img src=\"https://camo.githubusercontent.com/4313f3a318cedb0f72fbafca6a01cfd93b1424f8/68747470733a2f2f742e676f686972696e672e636f6d2f682f61366262643731666138396139386537373538333434646436373731373538616537323337323265396665626433303636643135326532346463663163333966\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/d1dd27632250b096e756409f6fd92bfbefcecb331c6f3285bc2bfc2eb28c1583\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0NhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a9427a4e41d94f7b04853437015fe5aff3f19f02/azeti%20GmbH.png"
    },
    {
        "id": "74015f33-84bb-433b-a9e6-a95c73568d84",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/74015f33-84bb-433b-a9e6-a95c73568d84",
        "created_at": "Mon Feb 22 09:52:27 UTC 2021",
        "company": "chargeIT empowering e-mobility ",
        "company_url": "http://www.chargeIT-mobility.com",
        "location": "Remote",
        "title": "Senior Fullstack Developer (m/f/d)",
        "description": "<p>Senior Fullstack Developer (m/f/d)\nFull-time in 01099 Dresden (Remote Option)</p>\n<p>E-mobility is the future ... and it has already started!</p>\n<p>Become part of chargeIT mobility who is part of Eneco eMobility - one of the leading providers of intelligent charging systems and solutions in the EV market that has built up a strong position in the Netherlands, Belgium and Germany. There is only one way to realize our current phase of international expansion: growing towards a digital company with scalable and smart IT solutions.</p>\n<p>That's why we'd love to welcome you on board so we can focus on enterprise platforms, user interfaces and user experience together. Your tasks will be in the area of headless CMS development, design and development of backend and frontend components and applications for web &amp; mobile.</p>\n<p>Ideally, you should already have experience in the field of eMobility. Fundamentally, you should be well-versed in headless CMS systems, GraphQL and modern frameworks for mobile and web applications, as well as enjoy implementing software from business concept to scalable product used by thousands of users. If so, you'll play a critical role in building scalable applications that delight our customers and teaching our way of working, which is based on the Scaled Agile Framework (SAFe).</p>\n<p>These are your tasks</p>\n<ul>\n<li>As a Senior Fullstack Developer (m/f/d) you are responsible for design, development and testing of applications and services.</li>\n<li>You work on the design as well as the implementation of a customer journey with inspiring UX and create SEO-friendly content &amp; products.</li>\n<li>You are quality oriented and willing to take responsibility for the working solution.</li>\n<li>Develop according to clean code principles, integrate automated tests and build pipelines.</li>\n</ul>\n<p>This distinguishes you</p>\n<ul>\n<li>At least 4 years of experience with various frameworks and libraries for API development and connectivity, in the UI space with React or Vue.js, and with various database systems</li>\n<li>Experience with headless CMS and static site generation is a plus</li>\n<li>Ability to develop software in an agile scrum process and willingness to work with remote teams</li>\n<li>Self-starter and motivated to make an individual contribution</li>\n<li>Fluency in English or German</li>\n</ul>\n<p>Benefits</p>\n<ul>\n<li>Company pension plan &amp; occupational disability insurance</li>\n<li>(e-)Bike leasing</li>\n<li>Individual training budget</li>\n<li>Mobile working: in the office, at home and on the road</li>\n<li>Flexible working hours and vacation</li>\n<li>Flat hierarchies</li>\n</ul>\n<p>Interested?</p>\n<p>We are looking forward to receiving your application documents including your salary requirements and possible starting date by e-mail to <a href=\"mailto:jobs@chargeit-mobility.com\">jobs@chargeit-mobility.com</a></p>\n<p>You want to know more about the job and us?\nYou can find more information on <a href=\"http://www.chargeIT-mobility.com\">www.chargeIT-mobility.com</a></p>\n",
        "how_to_apply": "<p>Email your resume to:\n<a href=\"mailto:jobs@chargeit-mobility.com\">jobs@chargeit-mobility.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmVaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ac88b3b8bd7674d5e53b86da125226878bc9f142/ChargeIT_1.jpg"
    },
    {
        "id": "01137733-08ed-456d-8cfa-5b6bf0616204",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/01137733-08ed-456d-8cfa-5b6bf0616204",
        "created_at": "Mon Feb 22 09:45:04 UTC 2021",
        "company": "Charge IT - empowering e-mobility",
        "company_url": "https://www.chargeit-mobility.com",
        "location": "Remote",
        "title": "Senior Frontend Developer (m/f/d)",
        "description": "<p>Senior Frontend Developer (m/f/d)\nFull-time in 01099 Dresden (Remote Option)</p>\n<p>E-mobility is the future ... and it has already started!</p>\n<p>Become part of chargeIT mobility who is part of Eneco eMobility - one of the leading providers of intelligent charging systems and solutions in the EV market that has built up a strong position in the Netherlands, Belgium and Germany. There is only one way to realize our current phase of international expansion: growing towards a digital company with scalable and smart IT solutions.</p>\n<p>That's why we'd love to welcome you on board so we can focus on enterprise platforms, user interfaces and user experience together. Your tasks will be in the area of headless CMS development, design and development of front-end components and applications for web &amp; mobile.\nYou already have experience in the field of e-mobility? With headless CMS systems, GraphQL and modern frameworks for mobile and web applications? In developing software from business concept to scalable product used by thousands of users? Then you'll play a critical role in creating scalable applications that delight our customers and in teaching our way of working, which is based on the Scaled Agile Framework (SAFe).</p>\n<p>These are your tasks\n▪ As a Senior Frontend Developer (m/f/d) you are responsible for the task breakdown of user stories and explaining the necessary technical effort to the Product Owner\n▪ The development of frontend applications and components as well as the connection of different APIs are also part of your tasks\n▪ You will work on the design as well as the implementation of a customer journey with inspiring UX and create SEO-friendly content &amp; products\n▪ Develop according to the Clean Code principle, integrate automatic tests and build pipelines\nBenefits</p>\n<p>This distinguishes you\n▪ B.Sc./B.A. e.g. in computer science or engineering.\n▪ At least 5 years of experience in the following technology: JavaScript, TypeScript, or other typed language\n▪ Proven experience developing single-page applications in React, Vue.js, or similar technologies\n▪ Strong interest in thoughtful solutions using proven as well as emerging technologies\n▪ Good command of English and German\n▪ Outgoing personality with attention to detail &amp; attentive work ethic</p>\n<p>Benefits\n▪ Company pension plan &amp; occupational disability insurance\n▪ Mobile working\n▪ (e-)Bike leasing\n▪ Flexible working hours and vacation\n▪ Individual training budget\n▪ Flat hierarchies</p>\n<p>Interested?\nWe are looking forward to receiving your application documents including your salary requirements and possible starting date by e-mail to <a href=\"mailto:jobs@chargeit-mobility.com\">jobs@chargeit-mobility.com</a></p>\n<p>You want to learn more about the job and us?</p>\n<p>You can find more information on <a href=\"http://www.chargeIT-mobility.com\">www.chargeIT-mobility.com</a></p>\n",
        "how_to_apply": "<p>Emails your resume to:\n<a href=\"mailto:jobs@chargeit-mobility.com\">jobs@chargeit-mobility.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlNaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--390ed3fcebde61bb56fac1981dc872c15b186ed8/ChargeIT_1.jpg"
    },
    {
        "id": "3c5fc02a-159b-4930-92aa-16bbc436f98a",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3c5fc02a-159b-4930-92aa-16bbc436f98a",
        "created_at": "Sat Feb 20 12:38:44 UTC 2021",
        "company": "Snickfish",
        "company_url": "http://Snickfish.com",
        "location": "Maryville, Tennessee",
        "title": "PHP Developer - NOT A REMOTE POSITION",
        "description": "<p>LOOKING FOR LOCAL PHP DEVELOPER IN THE KNOXVILLE/MARYVILLE, TENNESSEE AREA.\nWe are a title management company based in Maryville, TN.  We service over 41 states across the U.S. and are looking for someone with an upbeat professional attitude who's eager to hang with us.  It's an exciting and fun place to work where you can learn, earn, and grow with us! This position is NOT a remote position. Please do NOT apply if you cannot work at our offices in Maryville, Tennessee.</p>\n<p>PHP DEVELOPER\nQualified, self-driven developer responsible for maintaining, updating, and upgrading client and server-side HTML /CSS /JS, PHP &amp; Node Systems.\nResponsibilities include setting deadlines, performing or automating regular maintenance tasks, performing system account updates, and optimizing existing systems in both PHP 5.6 and 7.2.\nPay is relevant to work experience and knowledge base.</p>\n<p>General Requirements\nExperienced in Large or Scalable Web Development\nSeasoned in PHP\nWork Well in a fast-paced environment\nMust be able to use high-level logic &amp; reasoning\nMust have excellent communication skill\nMust be able to plan and set deadlines effectively\nMust be willing to learn, and keep up to date knowledge on web development practices\nKnowledgeable in Standard HTML, CSS &amp; JS\nKnowledgeable in Objective, Functional, &amp; Procedural Programing &amp; Methodologies\nAWS Experience (including but not limited to EC2, Route 53,  EBS operational &amp; maintenance experience)\nMySQL General Experience\nDocker &amp; Containerization knowledge, and experience.\n5 + years general programing experience\n2 + years of Object-Oriented programing experience\nLanguage/ Framework /Library Requirements:\nPHP 5.6\nPHP 7.3\nNodeJS (JavaScript)\nMySQL\nComposer (PHP)\nNPM (NodeJS)\njQuery (JavaScript)\nBootstrap (HTML, CSS)\nRecommended Frameworks/Libraries\nLaravel (PHP)\nReact (NodeJS)\nEnvironment Familiarity (Required)\nDocker\nAWS EC2\nLinux</p>\n<p>We provide a nice friendly environment with professional people.\nWe hire for life.\nSome staffers have been with us since our conception 13 years ago. Our employees arrive to work happy and leave happy and we like that a lot.\nThe dress code is casual.\nYou will receive vacation pay, major holiday pay, PTO, and bonuses.</p>\n<p>Hours are 8-5 Monday-Friday, with evenings and weekends off.\nSend us your resume and tell us a little about yourself, and we'll contact you with further details about our company and how to schedule an interview.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:NH8570@gmail.com\">NH8570@gmail.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdCtaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1f307ca60bf3947b4d117de93ba82e7b031fb2dc/snickfish-g-small.fw.png"
    },
    {
        "id": "60a48d98-fc07-4e36-b8ab-cf6778e527ca",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/60a48d98-fc07-4e36-b8ab-cf6778e527ca",
        "created_at": "Fri Feb 19 16:32:30 UTC 2021",
        "company": "BITGRIP GmbH",
        "company_url": "https://www.bitgrip.de",
        "location": "Berlin",
        "title": "Senior Frontend-Entwickler (w/m/x)",
        "description": "<p>BITGRIP ist Berater, Entwickler, Designer und Integrator für digitale Lösungen. Wir verwandeln Bits mit Herz und Grips in ein Lächeln. Auf Basis von über 500 Jahren geballter IT-Projekterfahrung helfen wir Kunden in jedem Bereich der digitalen Wertschöpfung.</p>\n<p><strong>Aufgaben</strong></p>\n<p>Du passt zu uns, wenn du ...</p>\n<ul>\n<li>weltweit Millionen von Usern glücklich machen willst, aber auch den Hype von Produktreife trennen kannst</li>\n<li>ein ambitionierter Coder bist, der für sein Fachgebiet brennt, egal ob du Autodidakt, graduiert oder Professional bist</li>\n<li>JavaScript (ES2015+) und CSS3 zu deinen wichtigsten Werkzeugen zählst</li>\n<li>gerne Verantwortung übernimmst und Dinge vorantreibst Wir passen zu dir, weil wir ...</li>\n<li>bewusst auf branchenübliches Project-Hopping verzichten und dir neben spannender Projekte eine familienfreundliche Arbeitsweise garantieren</li>\n<li>ein (r)evolutionäres Unternehmen sind, beinahe ohne Hierarchien – bei uns gibt es keine Abteilungen, - keine Angst und (fast) keine Überstunden, weil wir auf Selbstverantwortung, Freiheit, Spaß und Feedback setzen</li>\n<li>dir einen tollen Tech Stack und ein erfahrenes Team bieten, um gemeinsam zu wachsen und großartiges zusammen zu erreichen</li>\n</ul>\n<p><strong>Qualifikation</strong></p>\n<p><em>Unser Tech Stack:</em></p>\n<ul>\n<li>Natives JavaScript (ES2015+),</li>\n<li>HTML,</li>\n<li>CSS (SCSS),</li>\n<li>JSON</li>\n<li>Typescript (optional)</li>\n<li>React</li>\n<li>Redux (optional)</li>\n<li>Jest</li>\n<li>Node.js-Backend</li>\n<li>REST || GraphQL</li>\n<li>Babel, Webpack</li>\n<li>Jenkins, Docker</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>einen leistungsfähigen Tech Stack</li>\n<li>Flache Hierarchien, Eigenverantwortung, Spaß</li>\n<li>Auswahl deiner Hard- &amp; Software</li>\n<li>flexible Arbeitszeiten &amp; Homeoffice für alle</li>\n<li>Einen unbefristeten Voll- oder Teilzeitvertrag mit attraktiver Vergütung und ganz wichtig: bei uns werden Überstunden vermieden und in Freizeit umgewandelt</li>\n<li>Zertifizierte Schulungsangebote</li>\n<li>ein schickes Büro in verkehrsgünstiger Lage am Kudamm</li>\n<li>6 Wochen Urlaub</li>\n<li>Kein Dresscode</li>\n<li>BAV</li>\n<li>Jobrad / Bahnticket</li>\n</ul>\n<p>Klingt gut soweit? Dann bewird dich direkt oder melde dich via E-Mail, Twitter oder LinkedIn bei uns inklusive deines frühestmöglichen Eintrittstermins und deiner Gehaltsvorstellungen und wir bringen dich mit deinem neuen Team in Kontakt – unkompliziert und ohne zig Gesprächsrunden.</p>\n<p>Come and join the #besteamintown.</p>\n",
        "how_to_apply": "<p><a href=\"https://bitgrip.join.com/jobs/1884012-senior-frontend-entwickler-w-m-x?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bfrontend-entwickler%2Bw%2Bm%2Bx\">https://bitgrip.join.com/jobs/1884012-senior-frontend-entwickler-w-m-x?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bfrontend-entwickler%2Bw%2Bm%2Bx</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFNaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3f84437924cbad98c6c30cf413d8e6e7480c4fd5/bitgrip.png"
    },
    {
        "id": "5d42ea59-b94f-42bb-ba8f-e0418f714550",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/5d42ea59-b94f-42bb-ba8f-e0418f714550",
        "created_at": "Fri Feb 19 15:22:43 UTC 2021",
        "company": "Evernest GmbH",
        "company_url": null,
        "location": "Hamburg",
        "title": "Senior Frontend Engineer*",
        "description": "<p>Evernest is a Proptech startup from Hamburg backed by top investors. We are redefining how homes are bought and sold in metropolitan areas. To do so, we combine start-up culture with years of extensive industry experience. We are convinced that agents, sellers and buyers deserve a better service and more support. That is why we are bringing together the world’s top minds in technology, data and real estate. We offer agents and their clients a platform for a previously unseen and seamless real estate experience.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Building a top-notch and intuitive front-end for our platform that empowers real estate agents, buyers and sellers</li>\n<li>Building a mobile application that empowers real estate agents</li>\n<li>Evaluating visual designs from a technical perspective</li>\n<li>Being part of our agile, smart and open-minded team</li>\n<li>Getting better every day by taking on challenging tasks</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Solid understanding of and experience with React.js (&gt; 3 years)</li>\n<li>Profound knowledge of TypeScript/ESnext and its ecosystem (&gt; 3 years), ideally also of other programming languages</li>\n<li>Experience with CSS-in-JS technologies (preferred Emotion.js or Styled Components)</li>\n<li>Understanding the importance of A11y and how to implement it in custom components</li>\n<li>Mobile first layouts and responsive websites</li>\n<li>Solid understanding of and experience with React Native</li>\n<li>Semantic HTML and the value of SEO</li>\n<li>DevOps mindset: operating and maintaining our software is a collective responsibility</li>\n<li>Passion to share knowledge and strive to learn from others</li>\n<li>Constant drive for improving processes and thinking in long-term wins</li>\n<li>Good communication skills</li>\n<li>Fluency in English, written and verbal; German is a plus</li>\n</ul>\n<p><strong>Current Tech Stack</strong></p>\n<ul>\n<li>Docker, GCloud, Kubernetes</li>\n<li>PostgreSQL</li>\n<li>Python, Django, Django REST Framework</li>\n<li>ES6, React, Typescript, Node.js</li>\n<li>Contentful CMS</li>\n<li>Storybook</li>\n<li>Emotion.js</li>\n<li>Next.js</li>\n<li>GraphQL</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Permanent position with above average compensation package</li>\n<li>27 days of paid vacation</li>\n<li>Productivity equipment (laptop, mobile phone)</li>\n<li>Homeoffice</li>\n<li>Challenging position in a fast-paced environment</li>\n</ul>\n<p>Your mindset is what matters to us - your age, your sex or your origin makes no difference\nat Evernest. It’s important that you fit into our team.</p>\n<p>Sounds good? Just submit your resume!\n<a href=\"mailto:talents@evernest.com\">talents@evernest.com</a></p>\n",
        "how_to_apply": "<p>Sounds good? Just submit your resume!\n<a href=\"mailto:talents@evernest.com\">talents@evernest.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdENaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--646a06fa593b374c19fd40ef77accd91b98ccdbc/EN_Profilbild_V1.jpg"
    },
    {
        "id": "ad494559-7b93-4d26-85f6-b5350e0a5f5e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ad494559-7b93-4d26-85f6-b5350e0a5f5e",
        "created_at": "Fri Feb 19 15:17:31 UTC 2021",
        "company": "Evernest GmbH",
        "company_url": null,
        "location": "Hamburg",
        "title": "Senior Backend Engineer*",
        "description": "<p>Evernest is a Proptech start-up from Hamburg backed by top investors. We are redefining how homes are bought and sold in metropolitan areas. To do so, we combine start-up culture with years of extensive industry experience. We are convinced that agents, sellers and buyers deserve a better service and more support. That is why we are bringing together the world’s top minds in technology, data and real estate. We offer agents and their clients a platform for a previously unseen and seamless real estate experience.</p>\n<p>As a Senior Backend engineer, you'll join a team of engineers working on the data-driven, cutting-edge distributed platform which forms the backbone of our business.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Being part of a smart and motivated small team dedicated to building tech-driven, smarter processes that enable excellently trained real-estate agents to create a delightful home buying and selling experience</li>\n<li>Creating, developing and scaling our platform that empowers real estate agents, buyers and sellers</li>\n<li>Having high responsibility from day one and the chance to build a product from scratch</li>\n<li>Driving the development by working closely together with other developers and the VP Engineering</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Generalist with experience in multiple backend languages</li>\n<li>Experience in architecting &amp; building web &amp; service-oriented backend applications</li>\n<li>Experience developing production software with Python and its ecosystem</li>\n<li>Being able to work both in a team and independently</li>\n<li>Hands-on, pragmatic mindset without sacrificing quality</li>\n<li>Having a drive for improving processes and thinking in long-term wins</li>\n<li>Fluency in English (in both written and verbal communication); German is a plus</li>\n</ul>\n<p><strong>Bonus Skills</strong></p>\n<ul>\n<li>Experience with Django/Django Rest Framework</li>\n<li>Experience with Continuous Integration / Continuous Delivery, DevOps mindset</li>\n<li>Skills in other items from our technology stack</li>\n<li>Experience with Contentful</li>\n</ul>\n<p><strong>Tech Stack</strong></p>\n<ul>\n<li>Docker, GCloud, Kubernetes</li>\n<li>PostgreSQL</li>\n<li>Python, Django, Django REST Framework</li>\n<li>ES6, React, Typescript, Node.js</li>\n<li>Contentful CMS</li>\n<li>Emotion.js</li>\n<li>Next.js</li>\n<li>GraphQL</li>\n<li>Sentry</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Challenging position in a fast-paced environment</li>\n<li>Permanent position with above average compensation package</li>\n<li>Opportunities to shape the company and grow personally</li>\n<li>Homeoffice</li>\n<li>Productivity equipment (laptop, mobile phone)</li>\n</ul>\n<p>Your mindset is what matters to us - your age, your sex or your origin makes no difference at Evernest. It’s important that you fit into our team.</p>\n<p>Sounds good? Just submit your resume!\n<a href=\"mailto:talents@evernest.com\">talents@evernest.com</a></p>\n",
        "how_to_apply": "<p>Sounds good? Just submit your resume!\n<a href=\"mailto:talents@evernest.com\">talents@evernest.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczZaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--23aaaa2192fb7494e973d50157ab3ddacb5c35ee/EN_Profilbild_V1.jpg"
    },
    {
        "id": "4d2d9464-14a3-466d-ac9e-4c38365e25b5",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4d2d9464-14a3-466d-ac9e-4c38365e25b5",
        "created_at": "Thu Feb 18 21:28:54 UTC 2021",
        "company": "Ordergroove",
        "company_url": "https://www.ordergroove.com/",
        "location": "Anywhere in the US",
        "title": "Senior Software Engineer",
        "description": "<p>Ordergroove is looking for a talented, passionate and naturally curious person to join our Engineering Team. Our Software Engineers are problem solvers who get excited about pushing the boundaries of what we can achieve, love learning and thrive in a fast-paced, collaborative environment.</p>\n<p>We are quickly changing the way people shop online and how online retailers develop customer loyalty, and we’re looking for Software Engineers who can help us achieve this goal. The ideal candidate should be a problem solver by nature, who isn't afraid to learn new languages and gets excited about working with the latest technologies.</p>\n<p>The skinny:</p>\n<ul>\n<li>Develop new public facing features which are viewed by millions of customers</li>\n<li>Help create new Javascript SDK and libraries which help empower product customization</li>\n<li>Work on self-service tools and systems which power our user experiences</li>\n<li>Code, write tests and collaborate with an awesome group of highly passionate engineers</li>\n<li>Your work will run on the latest tech through Docker and Kubernetes in the Google Cloud Platform</li>\n</ul>\n<p>The specs:</p>\n<ul>\n<li>3+ years of vanilla JavaScript (ES6 or ES5) experience</li>\n<li>Strong working knowledge of HTML, CSS</li>\n<li>Problem solver by nature, we can find you on the weekends hacking up new apps</li>\n<li>Passionate about leveraging best-of-breed technology and eager to learn new skills</li>\n<li>Known team player</li>\n</ul>\n<p>Pluses:</p>\n<ul>\n<li>Experience working with web components</li>\n<li>Experience working with React, Angular or other frontend frameworks</li>\n<li>Experience working with NodeJS or other backend technologies</li>\n<li>Previous eCommerce experience</li>\n<li>Start-up and SaaS experience strongly preferred</li>\n<li>Bachelor's degree in Computer Science, Engineering or a related field preferred but not required</li>\n</ul>\n<p>If you don’t meet 100% of the qualifications outlined above - that’s okay, nobody’s perfect! We encourage you to apply if you think this is a role that would make you excited to come into work every day.</p>\n<p>About Ordergroove:</p>\n<ul>\n<li>Raised $40M from top notch investors</li>\n<li>Headquartered in the heart of NYC with fully remote culture</li>\n<li>Over 100 clients including The Honest Company, Unilever, KIND Snacks &amp; L'Oreal</li>\n</ul>\n<p>Recently named one of the 2020 Best Companies to Work For in New York, our values celebrate collaboration, different perspectives and curiosity with the goal of getting to the right answer, no matter who came up with it. At Ordergroove we are committed to creating a welcoming and supportive environment for all people. We encourage people with different backgrounds and experiences to join our growing team so that we gain different perspectives and build the best team possible. We demand the best of ourselves and each other and never miss an opportunity to celebrate our success.</p>\n<p>Even while we are remote, staying connected and supporting each other is key to our culture. We build our community through small group events like trivia night, cooking classes and book club. We encourage cross-functional relationships through virtual coffees. And we stay close to the business through weekly team updates and quarterly all hands meetings.</p>\n<p>We know there are a lot of great companies out there. At OG we focus on flexibility and empowering our team to make the right decisions for themselves. We have flexible PTO (you take vacation when you need it, not when you have earned the hours), a new work-from-anywhere policy (totally remote anywhere in the US, or you can go into the NYC office as much as you would like), and an annual personal development budget that you use for what matters to you (wellness, career development, productivity at home, etc). And of course that is on top of the basics like competitive compensation (including stock options) and incredible, affordable benefits. Come #getgroovy and grow your career at Ordergroove!</p>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/a8b10af52us\">https://grnh.se/a8b10af52us</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcitaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--089b8d0d4c16f5e7f40e75d77feb1d06ee961ff1/Logo%20interlocked_oo%20(1).png"
    },
    {
        "id": "0f48aadd-549a-4d74-a461-d889342de1aa",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0f48aadd-549a-4d74-a461-d889342de1aa",
        "created_at": "Thu Dec 31 18:49:26 UTC 2020",
        "company": "Benco Dental",
        "company_url": "http://www.benco.com",
        "location": "Nationwide/Remote",
        "title": "Software Developer - Full Stack",
        "description": "<p>Benco Dental, the Nation's largest privately-owned dental distributor, is searching for a Developer to join its team in Pittston, PA or remotely!</p>\n<p>Why Join our Team?</p>\n<p>We drive dentistry forward by leveraging innovative solutions and our caring family culture.</p>\n<p>Family-owned for 80+ years</p>\n<p>#19 Best Companies to Work for in Health Care</p>\n<p>Annual Profit Sharing</p>\n<p>Medical, Dental, Vision effective Day 1</p>\n<p>Job Summary:  Responsible for developing code and software as per specifications, both new code and modifications to existing code; troubleshooting and resolving issues with code; documenting changes; training users on changes as appropriate. This application developer role will be part of the Benco Enterprise Application and Architecture team, which is dedicated to sustainability and modernization of Benco’s core systems.  We are a fast pace, agile team that works on a wide range of projects across multiple technologies.</p>\n<p>Qualifications:</p>\n<p>Education:  Associates degree in Computer Systems or equivalent education/experience; Bachelor’s degree preferred.</p>\n<pre><code>         Experience:  3-5 years\n</code></pre>\n<p>Skills needed:  Ability to communicate clearly, persuasively and effectively both verbally and written; good organizational skills; experience with</p>\n<p>SQL</p>\n<p>C# (.NET Core/.NET Framework)</p>\n<p>Front-end Web Development (HTML, CSS, JS)</p>\n<p>Front-end JavaScript Framework (Angular, React, etc.) Experience is a plus not required.</p>\n<p>System Integration (ETL, REST API)</p>\n<p>Duties and Responsibilities:</p>\n<p>Effectively develops code and software as per specifications.</p>\n<p>Tests software that has been created or modified.</p>\n<p>Documents changes to software.</p>\n<p>Demonstrates good oral and written communication skills and listening skills.</p>\n<p>Effectively trains appropriate personnel on newly developed or modified software.</p>\n<p>Troubleshoots and debugs software.</p>\n<p>Consistently and effectively updates ALM tool (Jira) with appropriate comments to track progress of work.</p>\n<p>Performs Code Reviews for other team members.</p>\n<p>Breaks down work into estimable pieces and delivers accurate and consistent difficulty estimates.</p>\n<p>Works as an effective team member and works to improve team morale.</p>\n<p>Understands IT’s role in helping Benco realize its mission.</p>\n<p>Performs other duties as assigned to support the efficient operation of the department and company.</p>\n<p>All job duties and responsibilities are essential functions of the position.</p>\n<p>Who We Are: It’s our mission to deliver success smile after smile.</p>\n<p>Benco Dental is the largest privately owned, full-service dental distributor in the United States and has remained in the family since 1930 - a family that now includes our more than 30,000 customers and over 1,400 associates in the 48 contiguous states.</p>\n<p>We provide more supply and equipment options than any other full-service distributor, an offering enhanced by a comprehensive suite of services, including office design, equipment repair, practice coaching, financing and project management, wealth management and dental-specific technology solutions. These services are supported by over 400 professionally trained sales representatives and 300 factory-trained service technicians who begin every task by asking \"What does the customer want?\"</p>\n<p>If you enjoy working for a progressive company that is growth minded and values customers &amp; associates we encourage you to learn more about our Benco family. We are looking for driven professionals who want to play a key role in our future success.</p>\n",
        "how_to_apply": "<p>Apply at <a href=\"http://www.benco.com/careers\">www.benco.com/careers</a> or by clicking on the link:\n<a href=\"https://benco.hrmdirect.com/employment/job-opening.php?req=1469247&amp;&amp;#job\">https://benco.hrmdirect.com/employment/job-opening.php?req=1469247&amp;&amp;#job</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGVVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d62f0959d9f4f10d672f89867337ab5d5c08e952/19_BencoLogo_Color_2019.jpg"
    },
    {
        "id": "21987e74-9ab0-4db1-b7b1-e23f4cc5fc68",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/21987e74-9ab0-4db1-b7b1-e23f4cc5fc68",
        "created_at": "Thu Feb 18 14:18:44 UTC 2021",
        "company": "Enpal GmbH",
        "company_url": "https://www.enpal.de",
        "location": "Berlin",
        "title": "Senior Software Engineer - Fullstack (m/f/d)",
        "description": "<p>We are looking for several Senior Software Engineers to join our great Tech team in Berlin to create the future of our products. Your responsibilities will include both the frontend and the backend architecture in the respective frontend and cloud framework, design of Restful Services, Creation of APIs, Definition of Data Exchange Formats such as JSON, XML, SOAP.</p>\n<p>You’ll be part of a cross-functional team that’s responsible for the full software development life cycle. If you’re also familiar with Agile methodologies, we’d like to meet you.</p>\n<p>We are a well funded startup of 4 years in the green energy sector working on a Energy Cloud Computing Fullstack framework. You will be responsible for server side and client side applications.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>You work with development teams and product managers to ideate software solutions.</li>\n<li>You design client-side and server-side architecture and build the front-end of applications through appealing visual design.</li>\n<li>You develop and manage well-functioning databases and applications.</li>\n<li>You write effective APIs and technical documentation.</li>\n<li>You test software to ensure responsiveness and efficiency.</li>\n<li>You troubleshoot, debug and upgrade software and work with data scientists and analysts to make further improvements.</li>\n<li>You create security and data protection settings.</li>\n<li>You build features and applications with a mobile responsive design.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>BSc/MSc in Computer Science or similar study programs.</li>\n<li>At least 5 years of professional experience in Software Development, ideally including inhouse tech teams.</li>\n<li>Proficiency in one or more of the following technologies: C#, Javascript, Node.js, React.js, Flutter, and deep understanding of Cloud technologies (Azure preferred).</li>\n<li>Experience with DevOps Tools like Jenkins, gitlab, Docker, ansible, packer, terraform, chef or puppet.</li>\n<li>Good understanding of Cloud frameworks (Azure, AWS, GCP).</li>\n<li>Understanding of Architectural Principles such as Microservices, MVC, etc.</li>\n<li>Ability and willingness to solve challenging engineer problems and learn new domains.</li>\n<li>Excellent English skills, German is a plus.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The chance to be part of a fast-growing and future-oriented startup: we are one of the biggest players in the solar business.</li>\n<li>Help to make the world a bit better: we are all about green energy.</li>\n<li>Direct impact on our corporate success and exciting career opportunities: leave your footprint.</li>\n<li>Close cooperation with the management team while shaping Enpal’s tech DNA: you will be part of our first Tech Team.</li>\n<li>Work with the best in the industry and grow with us: there’s plenty of room for your ideas.</li>\n<li>A great work environment in our Berlin office, or focused work from home- you decide.</li>\n</ul>\n<p>Even though we ask for a lot in this job ad: we do not hire for tech stack only!</p>\n<p>We are looking for great problem-solving skills, passion for industry-disrupting products and innovative minds. We cannot wait to hear from you!</p>\n",
        "how_to_apply": "<p><a href=\"https://enpal.join.com/jobs/1906268-senior-software-engineer-fullstack-m-f-d?pid=71fbd6149a82b0b128ee&amp;utm_source=stackoverflow&amp;utm_medium=paid&amp;utm_campaign=stackoverflow&amp;utm_content=senior%2Bsoftware%2Bengineer%2B-%2Bfullstack%2Bm%2Bf%2Bd\">https://enpal.join.com/jobs/1906268-senior-software-engineer-fullstack-m-f-d?pid=71fbd6149a82b0b128ee&amp;utm_source=stackoverflow&amp;utm_medium=paid&amp;utm_campaign=stackoverflow&amp;utm_content=senior%2Bsoftware%2Bengineer%2B-%2Bfullstack%2Bm%2Bf%2Bd</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckNaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9ffee119ed2837b4138b67b037eaea9aa7ecf1f2/enpal_logo.eps.jpg"
    },
    {
        "id": "2b78c92c-c8a4-420a-88e9-4a5fc232284b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2b78c92c-c8a4-420a-88e9-4a5fc232284b",
        "created_at": "Wed Feb 17 22:37:26 UTC 2021",
        "company": "Openforce",
        "company_url": "http://www.oforce.com",
        "location": "Remote in US",
        "title": "Senior Software Engineer",
        "description": "<p>Overview: As Senior Software Engineer, you will join a team of mainly full stack engineers with exposure to everything, collaborating with product and other technology leaders to jointly chart the platform roadmap.</p>\n<p>General Summary:\nOur team builds and maintains all client facing interfaces (e.g. web app, APIs, etc.) to enable the independent contractor model through the platform. We are mostly full stack engineers with exposure to back-end, front-end, and everything in between. The collaborative nature of the team allows you to constantly learn new things. You’ll work closely with other software engineers across the engineering organization to innovate on our platform architecture, and to continue building a world-class technology platform.\nTo be successful in this role, you should be confident contributing to the development of our products, making recommendations for solutions and new technology approaches, and pushing for better software practices.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Serve as technical/development lead on specific initiatives</li>\n<li>Review architecture and technical design on key projects</li>\n<li>Collaborate with Product to validate use cases and requirements</li>\n<li>Lead code quality and testing across engineering teams</li>\n<li>Provide technical mentorship to junior engineers</li>\n<li>Influence and evangelize new software technologies to other team members</li>\n<li>Work closely with other software architects to make engineering wide architecture recommendations and decisions</li>\n<li>Experiment with new ways of visualizing large amounts of data</li>\n<li>Ensure our technology stack stays current</li>\n<li>Passionate about building a world-class technology platform</li>\n</ul>\n<p>Key Competencies and Skills:</p>\n<ul>\n<li>Technical Expertise: Possesses an in-depth knowledge and skill in a technical area</li>\n<li>Problem Solving: Frames problems before trying to solve them. Breaks down problems and identifies all of their facets, including hidden or tricky aspects</li>\n<li>Analytical Thinking: Weights the costs, benefits, risks, and chances for success in making a decision</li>\n<li>Fostering Innovation and Teamwork: Sponsors the development of new products, services, methods, or procedures while working cooperatively with others to produce initiative solutions</li>\n<li>Developing Others: Provides helpful, behaviorally specific feedback to others and gives people assignments that will help develop their abilities</li>\n<li>Results Orientation: Maintains commitment to goals in the face of obstacles and frustrations; develops challenging but achievable goals</li>\n</ul>\n<p>Knowledge, Skills, And Abilities</p>\n<ul>\n<li>Degree in Computer Science or equivalent work experience</li>\n<li>10+ years of software development experience</li>\n<li>High degree of comfort in Elixir, ASP or other functional or object-oriented language</li>\n<li>Experience with scalable, high performance, multi-tier, enterprise application development</li>\n<li>Familiarity with JavaScript frameworks such as React</li>\n<li>Experience with data storage technologies</li>\n<li>Experience with queuing and messaging frameworks</li>\n<li>Experience with service-oriented architecture</li>\n<li>Keen sense of information architecture and visual design</li>\n<li>Motivated by writing fast, scalable code with testability in mind</li>\n<li>Excited by working in a fast-paced environment</li>\n</ul>\n<p>The Perks</p>\n<ul>\n<li>Continued training and career development</li>\n<li>Full Benefits Package including: Medical, Dental, Vision, Disability, and 401k</li>\n<li>Vacation and Holiday pay</li>\n<li>Casual dress code and creative office environment</li>\n</ul>\n<p>Job Type:\tFull Time Exempt</p>\n<p>Reports to: \tDirector of Engineering</p>\n<p>Salary: \t\tDOE</p>\n<p>Travel: \t        Up to 5% quarterly or as needed</p>\n<p>Passion, excellence, respect, accountability and having fun are just the beginning. Openforce believes that our culture is at the core part of what makes us successful. We are looking forward to hiring someone who understands good culture and will help shape it as it evolves.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@oforce.com\">careers@oforce.com</a>!</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE9aIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--96b6c0ac096d817f4f10586852474d5491a6d6e4/oforce-stacked-pms-color.png"
    },
    {
        "id": "377e8e58-7bd1-45ca-8ccf-4d633381d4c8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/377e8e58-7bd1-45ca-8ccf-4d633381d4c8",
        "created_at": "Thu Jan 07 06:47:16 UTC 2021",
        "company": "Ikayzo",
        "company_url": "http://ikayzo.com",
        "location": "United States",
        "title": "Senior Enterprise Software Engineer (Kotlin)",
        "description": "<p><em>Work with an award-winning team designing and implementing systems for customers from New York to Tokyo.</em> Ikayzo, a boutique software development and interactive design agency, is looking for a Senior Enterprise Software Engineer (Kotlin / Spring) capable of taking complex projects from ideation to release. In this role he/she will be responsible for designing and implementing applications for a wide range of customers ranging from fintech startups and renewable energy companies to global banks. We promote from within, and this position has the potential to develop into a tech lead role. Ikayzo offers competitive compensation and benefits including 24 days of paid time off per annum for full time employees.</p>\n<p><em>Note: We are currently only hiring in the United States and Japan. Remote developers are being considered, but they must be US or Japanese citizens or have valid work visas.</em></p>\n<p><strong>Job Description</strong></p>\n<p>The position of Senior Enterprise Software Engineer entails software architecture, implementation, development of best operational practices, testing and documentation of non-trivial systems with massive scalability requirements. Full stack experience with popular client frameworks such as  React.js is preferred. As a boutique consultancy we are looking for motivated individuals who do not require step-by-step directions and can work cohesively with our team.</p>\n<p>Successful applicants will have a proven track record with non-trivial enterprise Kotlin and Java projects, be comfortable with agile development methodologies, have a solid grounding in OO software architecture / design patterns and be comfortable with the enterprise Kotlin / Java technology stack including frameworks such as Spring from front to back. Most importantly, candidates must have a passion for programming. Our interviews are rigorous, so only serious developers with the requisite skills need apply.</p>\n<p>Send your resume and a link to your GitHub profile to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a>.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>A solid grounding in OO software architecture / design patterns</li>\n<li>Experience designing and implementing successful non-trivial enterprise Kotlin projects</li>\n<li>Experience with agile development methodologies</li>\n<li>Deep knowledge of the de facto Kotlin enterprise stack including Spring and Hibernate</li>\n<li>Familiarity with React.js</li>\n<li>Firm grasp of data modeling</li>\n<li>A passion for software development</li>\n</ul>\n<p><strong>Preferred</strong></p>\n<ul>\n<li>PostgreSQL and MongoDB expertise</li>\n<li>Contributions to open source projects</li>\n<li>Financial systems experience a plus</li>\n</ul>\n<p><strong>About Ikayzo</strong></p>\n<p>Ikayzo is a boutique software development and interactive design agency working in areas ranging from fin-tech to renewable energy. Ikayzo develops desktop, web and mobile applications for multiple platforms including Ruby on Rails, Kotlin / Java, iPhone, Android, and .NET. We are active in the open source community.</p>\n<p>Ikayzo has worked with Google, IBM, Intel, Sun, Adobe, Oracle, Apache, Red Hat and SAP on developing technology standards for everything from enterprise software to scientific applications. From New York to Tokyo, our customers range from database leader Oracle to trusted financial institutions like Bank of America. We work with customers of all sizes in a variety of industries including biotechnology, banking, renewable energy, social media / web 2.0 and software.</p>\n",
        "how_to_apply": "<p>Email resume and GitHub profile to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e254e5368909e8a838138a58a81c6d352af03cdd/logo-final.png"
    },
    {
        "id": "a63feabb-6976-4f74-b788-44afa96aed06",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a63feabb-6976-4f74-b788-44afa96aed06",
        "created_at": "Wed Feb 17 20:07:40 UTC 2021",
        "company": "Quadio",
        "company_url": "https://quadio.com",
        "location": "New York",
        "title": "Senior Frontend Engineer",
        "description": "<p>Quadio, an exciting new ecosystem of IRL and digital businesses designed to champion college creativity, is looking to expand its tech team as it rapidly advances v2 of its mobile-first app toward release. Founded in 2019 by an EDM producer with a passion for innovation and artistic collaboration and a Cornell grad with stints in strategy and marketing at Twitter and BlizzardActivision, Quadio’s team has grown to 24 strong, with a renowned board of advisors and strong financial funding. With a culture of creativity, urgency, and candor, Quadio seeks a wicked-smart, super-energized engineer who loves the arts and the people who make them come to life, embraces intensity and challenge with enthusiasm, and finds transparency as refreshing as we do. Our in-house motto is, “LET’S GOOOO,” and if that kind of positivity appeals to you, read on.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Implement the features and user experiences that power Quadio’s web and mobile applications</li>\n<li>Architect efficient and reusable front-end systems that drive complex applications</li>\n<li>Collaborate closely with our Design, Marketing, and Product teams to build an engaging user experience for our users</li>\n<li>Build products and experiences people love through intuitive design and clear user experiences</li>\n<li>Take your ideas from concept to reality</li>\n<li>Put automated testing, tracking, and monitoring in place to ensure our systems are always working as expected</li>\n</ul>\n<h2>Experience</h2>\n<ul>\n<li>A minimum of 5 years of experience developing applications using Javascript/Typescript, including advanced knowledge of concepts like asynchronous programming, closures, types, and ES2015+</li>\n<li>Expertise in React Native, with experience in build and release pipelines - specifically publishing applications across both Apple’s iStore and Google’s Play Store.</li>\n<li>Expertise in browser APIs and optimizing for frontend performance</li>\n<li>Experience working with RESTful APIs and/or GraphQL as well as client/server architectures</li>\n</ul>\n<h2>Additional (Standout Qualifications)</h2>\n<ul>\n<li>Experience with frontend state management frameworks such as Redux, MobX-state-tree, or Vuex</li>\n<li>Experience in bridging React Native components across Java/Kotlin and/or Swift</li>\n<li>Experience with frontend frameworks like React, AngularJS, Vue.js, or another equivalent framework</li>\n<li>Expertise in HTML &amp; CSS, with a knack for layout, specificity, cross-browser compatibility, and accessibility</li>\n<li>Experience with AWS APIs, such as DynamoDB, Lambda, or CDK</li>\n<li>Excited about the opportunities and challenges of working on projects touching all areas of our codebase and associated microservices</li>\n<li>Experience with containerization tools, such as Docker or Kubernetes</li>\n<li>BS/MS in Computer Science or an equivalent major</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:anthony@quadio.com\">anthony@quadio.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWlaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--07552c41932649728393054d493fcd94b39f6a16/QuadioIcon.png"
    },
    {
        "id": "507628b3-95ce-431b-a531-4efef56b67e6",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/507628b3-95ce-431b-a531-4efef56b67e6",
        "created_at": "Wed Feb 17 19:10:06 UTC 2021",
        "company": "SUNSOFT ONLINE",
        "company_url": "https://SunSoftOnline.com",
        "location": "Phoenix Arizona",
        "title": "Web/Mobile developer",
        "description": "<p>Job Description</p>\n<p>We are looking for an experienced web developer proficient in PHP, MySQL, Drupal, Wordpress, CSS, JQuery, and ideally, Adobe Suite. Candidates will be responsible for working with a diverse team across multiple projects for building and maintaining web and mobile ready applications in a fast paced environment.</p>\n<p>A commitment to collaborative problem solving, sophisticated design, and quality product is essential. Applicants will need drive to develop innovative new applications to meet business needs and achieve goals around improving public health outcomes for Arizonans.</p>\n<p>Responsible for maintaining and improving enterprise level applications using best practices and reusable modular designs; proactively identifying and solving complex technical problems.</p>\n<p>Job Duties:</p>\n<p>Translate application mockups, and use cases into functional applications\nImplement custom modules and update our intranet and public websites. Collaborate with other developers using a code repositories and version control, such as Git-hub workflow to branch, merge, and deploy changes</p>\n<p>Design, build, and maintain efficient, reusable, and reliable PHP code</p>\n<p>Develop on the LAMP/LEMP stack using modern, object-oriented PHP</p>\n<p>Familiarity with concepts of ORM, and RESTful, Jquery, and Nodejs</p>\n<p>Assist in developing HTML, CSS, and client-side JavaScript using modern technologies and methodologies.</p>\n<p>Ensure the best possible performance, quality, and responsiveness of applications\nIdentify bottlenecks and bugs, and devise solutions to these problems\nCreates deliverables according to SDLC, prepares technical documentation, unit tests, and user guides.\nMentor junior members in the team</p>\n<p>Knowledge, Skills &amp; Abilities (KSAs):</p>\n<ul>\n<li>Current: 4 Years developing on web and mobile friendly technologies Experience with Wordpress, Drupal codebase</li>\n<li>Proficient in JavaScript development (e.g. jQuery, React, Knockout.js, Node.js)\nProficient in PHP</li>\n<li>Using and creating APIs including REST and SOAP</li>\n<li>Familiarity with Version Control in both Git and web-based repositories (GitHub, GitLab, etc.)</li>\n<li>Awareness of cross platform development best practices (e.g. mobile first, responsive design, progressive web applications)</li>\n<li>MySQL\nUnderstanding of fundamental design principles behind a scalable application</li>\n<li>Familiarity with various design and architectural patterns and continuous integration</li>\n<li>Excellent customer service skills</li>\n<li>Excellent interpersonal, written and oral communication skills.</li>\n<li>Detail oriented and trusted to consider pitfalls before they occur.</li>\n<li>Full stack developer with capability to follow through on a project from conception to completion.</li>\n<li>Quickly learn and develop using new programming languages, platforms and APIs.</li>\n<li>Awareness of security vulnerabilities and safeguards.</li>\n<li>Familiarity with agile methods and scrum</li>\n</ul>\n",
        "how_to_apply": "<p>Please email your resume to <a href=\"mailto:victor@sunsoftonline.com\">victor@sunsoftonline.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbU9aIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6871b376d5291efd1f78dee7b2b057de6cf8321d/SunSoft-logo1.jpg"
    },
    {
        "id": "922bafc3-4234-46d6-a766-7945b05349d3",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/922bafc3-4234-46d6-a766-7945b05349d3",
        "created_at": "Tue Feb 16 16:50:20 UTC 2021",
        "company": "MentorMate",
        "company_url": "https://mentormate.com/",
        "location": "Remote",
        "title": "JavaScript Developer w/ Vue.js",
        "description": "<p><strong>OVERVIEW</strong></p>\n<p><em>Note: Due to the current public health situation, all job interviews will be conducted online until further notice.</em></p>\n<p>We are looking for a passionate JavaScript developer to join our super cool team of Vue experts. You’ll have the honor to participate in the creation of enterprise-class web applications, using proven design patterns on the latest technology platforms.</p>\n<p>You don’t need astronaut skills to become part of our incredible Vue team – you simply need to have experience building user interfaces and single-page applications with Vue, to love writing tests (or specs, whichever you prefer), and to work in a dynamic environment with international clients.</p>\n<p>Our software solutions tackle specific tech challenges across several industries. While our roots are in education, nearly half of our current projects are focused on healthcare and the large amounts of secure data that come with it. We also innovate in finance, real estate, commerce, IoT, and others.</p>\n<p><strong>WHAT YOU NEED TO HAVE:</strong></p>\n<ul>\n<li>1+ years of experience with Vue.js</li>\n<li>2+ years of experience with JavaScript</li>\n<li>Experience with HTML5, CSS3</li>\n<li>Experience with Vuex, Mobx, Flux or Redux</li>\n<li>Experience in developing cross-browser web applications</li>\n<li>Responsible team player with awesome communication skills</li>\n<li>Excellent spoken and written English</li>\n</ul>\n<p><strong>EXTRA POINTS IF YOU HAVE:</strong></p>\n<ul>\n<li>Experience with JS OOP Design Patterns</li>\n<li>Experience with React.js</li>\n<li>Experience with Angular</li>\n<li>BS/MS Degree in Computer Science or equivalent</li>\n</ul>\n<p><strong>WHAT WILL YOUR RESPONSIBILITIES BE:</strong></p>\n<ul>\n<li>Participate in the architecture, design and development phase of software production</li>\n<li>Build single page applications with Vue.js</li>\n<li>Build server-side RESTful APIs (JSON/XML)</li>\n<li>Deliver high-quality software with extensive Unit Testing</li>\n<li>Ensure the best possible performance, quality, and responsiveness of applications</li>\n<li>Enforce best coding and UI standards, evaluate others’ work</li>\n<li>Participate successfully in an established daily Scrum process</li>\n</ul>\n<p><strong>HOW WILL YOU SPEND YOUR TIME:</strong></p>\n<ul>\n<li>50% Writing code and tests</li>\n<li>25% Scrumming and helping others on the team</li>\n<li>10% Reviewing teammates’ code</li>\n<li>5% DevOps</li>\n<li>5% Refactoring</li>\n<li>5% Documenting</li>\n</ul>\n<p><strong>WHAT WE OFFER:</strong></p>\n<ul>\n<li>Freedom to work remotely from anywhere in the world</li>\n<li>Opportunity to join a community of 650+ developers worldwide</li>\n<li>Latest technologies to choose from</li>\n<li>Inspiring opportunities to work on various projects and software solutions that set standards</li>\n<li>Professional growth in a global company</li>\n<li>Chance to upgrade your benefits package based on the number of hours you work with us</li>\n<li>Employee referral program with bonuses</li>\n</ul>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://bit.ly/2ZvEqZf\">https://bit.ly/2ZvEqZf</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazZaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--00e45544149b0ca2c12cd0ea34d47b14b59e11fb/MM-logo-stacked-color%20(1).png"
    },
    {
        "id": "1d4e9ba0-865c-41e6-96a2-88773ee01242",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1d4e9ba0-865c-41e6-96a2-88773ee01242",
        "created_at": "Mon Feb 15 10:49:23 UTC 2021",
        "company": "Synedat Consulting GmbH",
        "company_url": "https://www.synedat.com/",
        "location": "Helmstedt",
        "title": "Full Stack Developer (m/w/d)",
        "description": "<p><strong>DEINE AUFGABEN</strong></p>\n<ul>\n<li>professionelle Umsetzung von kundenindividuellen Anforderungen in Projekten über alle Phasen des Entwicklungsprozesses hinweg (E-2-E)</li>\n<li>Entwicklung und Integration von modernen IT-Anwendungen insbesondere im Cloud-Umfeld</li>\n<li>Unterstützung beim Application-Management</li>\n</ul>\n<p><strong>DEIN PROFIL</strong></p>\n<ul>\n<li>Abgeschlossenes (Fach-)Hochschulstudium mit Fachrichtung Informatik oder einer vergleichbaren Ausbildung</li>\n<li>umfangreiche Berufs- und Projekterfahrung in der Anwendungsentwicklung im Bereich Automotive</li>\n<li>Sehr gute Kenntnisse in der Entwicklung mit aktuellen Java SE/EE Technologien</li>\n<li>fundierte und praktische Kenntnisse moderner Frameworks und Werkzeuge (z.B.: React, Spring, Angular, JPA, Hibernate, JSON, XML, Eclipse/IntelliJ)</li>\n<li>Sicherer Umgang in der Anwendung von bekannten Vorgehensmodellen / Methoden (z.B. Agile, Scrum, UML, Patterns, Refactoring)</li>\n<li>Kenntnisse im Einsatz von Applikationsservern, Datenbanksystemen oder Middleware-Produkten</li>\n<li>Erfahrungen mit der Konzeption und Implementierung von Schnittstellen zur Integration neuer und bestehender IT-Systeme in Cloud-Architekturen</li>\n<li>analytisches Denkvermögen</li>\n<li>ausgeprägte Kunden- und Serviceorientierung</li>\n<li>Teamfähigkeit und Kommunikationsstärke</li>\n<li>sehr gute Kenntnisse der deutschen Sprache in Wort und Schrift</li>\n</ul>\n<p><strong>WARUM WIR?</strong></p>\n<ul>\n<li>eine anspruchsvolle Tätigkeit in einem qualifizierten und engagierten Team</li>\n<li>Verantwortung von Anfang an mit weitergehenden Perspektiven</li>\n<li>angemessene, leistungsorientierte Vergütung</li>\n<li>regelmäßige, fachspezifische Weiterbildungen</li>\n<li>moderne Arbeitsmittel und hochwertig ausgestattete Arbeitsplätze</li>\n<li>Verlässlichkeit, Offenheit, Fairness und Respekt in der Zusammenarbeit</li>\n<li>flexible Arbeitszeiten für Ihre Work Life Balance</li>\n<li>Mitwirkung bei der Entwicklung eines dynamischen, wachsenden Dienstleistungsunternehmens</li>\n</ul>\n<p><strong>ÜBER UNS</strong></p>\n<p>Als agiles Technologie- und Beratungsunternehmen aus Niedersachsen ist es unsere Motivation, neue Impulse zu setzen und Optimierungsmöglichkeiten für unsere Partner aufzuzeigen. Damit aus dieser Vision auch ein echter Erfolg werden kann, braucht es die richtige Beratung und Umsetzung. Unternehmen kennen ihre Ziele und Herausforderungen, wir die Praktiken und Methoden auf dem Weg zur besten Lösung.\nIn Zeiten immer komplexer werdender Ansprüche heißt es, Zusammenhänge zu verstehen und verständlich zu machen. Die Herangehensweise an Projekte mit großer Komplexität meistern wir als Team und vor allen Dingen auch mit Spaß an der Arbeit.</p>\n<p>Verschiedene Charaktere und Stärken ergänzen sich bei uns zu einem erfolgreichen Team. Wir möchten uns miteinander wohlfühlen, während wir Lösungen für unsere Kunden erarbeiten. Unseren Kollegen begegnen wir auch nach der Arbeitszeit mit einem ehrlichen Lächeln.\nZur Bewältigung der wachsenden Auftragslage benötigen wir motivierte IT-Experten. Wenn Du Lust hast, mit einem dynamischen, innovativen Team die digitale Transformation voranzutreiben, dann bewirb Dich jetzt bei uns!</p>\n<p>Sende uns Deine Bewerbung mit Deiner Gehaltserwartung sowie dem frühestmöglichen Starttermin.</p>\n<p><strong>Hinweis für Personalvermittler:\nDie Ausschreibungen sowie die angegebenen Kontaktinformationen dienen ausschließlich zur Kontaktaufnahme durch freie Mitarbeiter und Stelleninteressenten. Wir bitten daher davon abzusehen, uns als Personalvermittler Recruiting-Dienstleistungen anzubieten.</strong></p>\n<p><img src=\"https://camo.githubusercontent.com/9a202139b06d2972d27d31bb3fa736197971a43d/68747470733a2f2f742e676f686972696e672e636f6d2f682f64326663613139616162613531326261316264336438366164326339306363656463363838373366616234373136616533343766363664626231656433353136\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/ccd8da240d65971991288dae01ae01ab6dbcef0b10592b3a07f5fbb1fc9831d2\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaldaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3cccb813e8c7ece7cb0d0347d1c0ce68f44a150b/Synedat.png"
    },
    {
        "id": "a7d8848e-0236-43e6-915e-c25915b2d38e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a7d8848e-0236-43e6-915e-c25915b2d38e",
        "created_at": "Sat Feb 13 00:27:48 UTC 2021",
        "company": "Mercury Intermedia",
        "company_url": "http://www.mercury.io",
        "location": "Brentwood, TN",
        "title": "Android Engineer",
        "description": "<p><strong>Overview</strong></p>\n<p>The Android Engineer will develop and maintain mobile applications targeted at multiple Android versions and devices while employing best practices for creating beautiful and performant apps. In addition, code should follow best practices for programming in a team environment with an emphasis on code clarity and maintainability. The engineer will interact with various product owners including internal departments and directly with external clients. The engineer may be asked to lead technical development on some projects, and follow technical lead on others. Remote work acceptable for US-based engineers.</p>\n<p><strong>This a permanent, full-time position. No corp to corp/C2C, recruiters, or agencies please.</strong></p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Build beautiful and performant Android apps</li>\n<li>Write clean, readable, and maintainable code</li>\n<li>Develop for a variety of Android devices from phones to TVs</li>\n<li>Create pixel-perfect renditions of design comps</li>\n<li>Work with legacy code as well as create greenfield code</li>\n<li>Work with various data sources and APIs</li>\n<li>Work on bug fixes, application performance and architectural tasks</li>\n<li>Evaluate and implement new libraries, patterns and technologies to solve challenging problems</li>\n<li>Peer review code for correctness, adherence to style norms, efficiency</li>\n<li>Interact directly with product stake holders and collaborate with cross-functional teams</li>\n</ul>\n<p><strong>Skills and Experience</strong></p>\n<ul>\n<li>5+ years shipping Android apps</li>\n<li>Proficient in Kotlin and Java</li>\n<li>Expert understanding of threading/concurrency</li>\n<li>Solid understanding of Dependency Injection, with experience using Dagger</li>\n<li>Solid understanding of Reactive Programming with experience with RxJava and/or Kotlin Flow</li>\n<li>Experienced in writing and maintaining Android apps with MVVM, MVP, MVI (pick 2)</li>\n<li>Strong in the art of Git Fu</li>\n<li>Experience working with small teams and interacting directly with stake holders</li>\n</ul>\n<p><strong>This Developer:</strong></p>\n<ul>\n<li>Keeps up with updates to the Android Framework</li>\n<li>Values code simplicity over \"cleverness\"</li>\n<li>Forms strong opinions on new libraries and programming paradigms before putting them in production code</li>\n<li>Knows when to solicit opinions before they code, and when to demonstrate the solution first</li>\n<li>Holds a strong opinion of their code, but will throw it away when a better solution is needed</li>\n<li>Knows that they don’t know everything</li>\n<li>Wants to teach as much as learn</li>\n<li>Is comfortable in Agile or traditional workflows</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@mercuryintermedia.com\">jobs@mercuryintermedia.com</a></p>\n",
        "company_logo": null
    },
    {
        "id": "8a9f0789-ce91-4ceb-9557-dec56750d37c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8a9f0789-ce91-4ceb-9557-dec56750d37c",
        "created_at": "Fri Feb 12 22:06:17 UTC 2021",
        "company": "GetThru",
        "company_url": "http://GetThru",
        "location": "Anywhere in the United States",
        "title": "Lead Engineer (Remote)",
        "description": "<p>GetThru is hiring a Lead Engineer to support 3-5 of our ~15 engineers. This is a “manager who codes” role: that is, it’s a management role foremost but does require active web application development skills for code review and pair programming.  There will also be opportunities to work directly on software development “off the critical path” as time allows.</p>\n<p>Our software is built using Elixir and the Phoenix web framework. This role is open both to experienced leaders who are new to Elixir development and to experienced Elixir developers who are new to management: either will receive appropriate training, mentorship, and support.  (Those who have experience in both are also welcome and encouraged to apply, of course.) The role will be a part of the Engineering team and report to the Vice President of Engineering.</p>\n<p><strong>About GetThru</strong></p>\n<p>GetThru’s mission is to empower organizations to connect authentically with their audiences at scale while building a sustainable company committed to progressive social change. Our tools have been used by more than 2,000 organizations to send over 1 billion text messages and make more than 500 million phone calls for voter contact, volunteer recruitment, fundraising, polling, and more. We are an all-remote company with 40+ full time staff spread across 14 states. Prior to the pandemic, we had a once-yearly all staff retreat, and held semi-annual in-person team meetings (e.g., sales, support, engineering). And while our roots are in progressive politics, we love partnering with organizations of all kinds that share our passion for creating a better world.</p>\n<p><strong>Who you are</strong></p>\n<ul>\n<li>A seasoned software engineer with web application development experience who can take primary responsibility for a complex software project while supporting less experienced engineers collaborating on that project.</li>\n<li>A disciplined and creative problem solver who can create your own direction in a low-structure environment, and execute on it.</li>\n<li>The person who steps in when something needs to get done -- even if it’s not glamorous or fun or explicitly your responsibility -- and makes sure it happens.\nSomeone who has or wants management experience.</li>\n<li>A collaborative and supportive teammate who believes that a team is greater than the sum of its parts.</li>\n</ul>\n<p><strong>What you'll do</strong></p>\n<ul>\n<li>Quickly come up to speed on the functionality of our two products and the technology underlying them.</li>\n<li>Support your team members and teammates in developing their technical and other professional skills through mentorship, coaching, pair programming, and code review.</li>\n<li>Set and enforce clear expectations for your team members; provide support and structure for success; promptly and empathetically address occasions when expectations are not being met.</li>\n<li>Actively seek opportunities for your team members to grow by taking on new challenges and responsibilities.</li>\n<li>Guide your team members and collaborate closely with Product, Design, Support, and other Engineering teammates to achieve successful project completion.</li>\n<li>Delegate responsibilities and outcomes -- with appropriate guidance given their skills and experience -- to your team members in ways that will support their growth and career goals.</li>\n<li>Work with your team members to define and advance professional development goals</li>\n<li>Collaborate with teammates to resolve service interruptions and high-impact defects; participate in on-call rotation.</li>\n<li>Develop software “off the critical path” for our products, internal tooling, or build pipelines; collaborate with teammates on their assigned projects.</li>\n<li>Collaborate to optimize, refine, and codify Engineering processes and processes for collaborating with other departments.</li>\n<li>Lead hiring processes to fill any openings on your team.</li>\n<li>Ensure your team members’ focus remains aligned with department and company-level goals.</li>\n<li>Actively support the development of a trusting and collaborative team culture.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<p>At least one of:</p>\n<ul>\n<li>Prior professional experience developing software using Elixir</li>\n<li>Prior experience as an engineering lead or manager</li>\n<li>A commitment to empathetic leadership</li>\n<li>Excellent written and verbal communication skills</li>\n<li>A commitment to / interest in progressive causes</li>\n<li>Authorized to work in the U.S. or Canada</li>\n</ul>\n<p>Our stack includes (prior experience in all of these is not necessary)</p>\n<ul>\n<li>Elixir</li>\n<li>Javascript (including Typescript and ES6)</li>\n<li>Phoenix</li>\n<li>Liveview</li>\n<li>ReactJS</li>\n<li>PostgreSQL</li>\n<li>Redis</li>\n<li>Docker</li>\n<li>Kubernetes</li>\n<li>AWS</li>\n</ul>\n<p><strong>Location</strong></p>\n<p>GetThru is an all-remote company with employees spread out across the country. Work from anywhere in the U.S. as long as there is good internet.</p>\n<p><strong>Compensation</strong></p>\n<ul>\n<li>$140,000-180,000 base salary, depending on experience</li>\n<li>Compensation for participation in on-call rotation</li>\n<li>Additional compensation via bonuses and participation in profit-sharing pool</li>\n<li>Participation in employee stock option pool</li>\n<li>401K + employer match that begins on or after 3 months of employment</li>\n<li>100% Health / dental / vision benefits for employees, 75% for dependents</li>\n<li>3 weeks of vacation time in year 1 and 2, with increases thereafter</li>\n<li>Additional benefits: ergonomic stipend, monthly wellness stipend, parental leave, charitable giving match</li>\n</ul>\n<p><strong>Equal Opportunity</strong></p>\n<p>GetThru provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics. As our company grows, we strive to make space for all kinds of people to do amazing work with us. We especially encourage applications from women, people of color, LGBTQ+ people, people with disabilities, immigrants, and other communities underrepresented in technology startups. We believe that a team with a wide range of backgrounds and experiences will be more creative, more adaptable, and more effective. And we strive to build a team that reflects the communities we are working to support.</p>\n",
        "how_to_apply": "<p>Please apply by going to:\n<a href=\"https://getthru.freshteam.com/jobs/AFGfdNioz1rv/lead-engineer-remote\">GetThru - Lead Engineer</a></p>\n<p>Please submit a resume and in your cover note, please explain why you want to work for GetThru in this role. Tell us what experiences make you a good fit, what causes you are connected to, and why you are excited about this job. This position is open until filled.</p>\n",
        "company_logo": null
    },
    {
        "id": "0e9ae5fa-5bbd-4395-aef7-a7a32e0abd01",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e9ae5fa-5bbd-4395-aef7-a7a32e0abd01",
        "created_at": "Fri Feb 12 16:03:36 UTC 2021",
        "company": "Mas & Pas Limited",
        "company_url": "http://http",
        "location": "London ",
        "title": "Experienced Full Stack Web Developer - London-Based or Remote",
        "description": "<p>Full Stack Web Developer; Experienced Developer for Complex Web Platform - London-Based or Remote</p>\n<p>Seeking an experienced, self-motivated Front and Back End Web Developer to join a small London-based team. Remote working arrangements could be considered.</p>\n<p>The right candidate would be responsible for developing advanced features in the community chat groups of the platform.</p>\n<p>They would also be responsible for managing other aspects of the live site and ensuring that its smooth operation.</p>\n<p>Who are we:</p>\n<p>Mas &amp; Pas is a parenting network with community forums, a local events platform, and a large library of web content.</p>\n<p>Responsibilities include:</p>\n<p>●      Plan and architect the technology for a number of new features - including live chat, video sharing webinar hosting and online booking systems.\n●      Migrate the website's content from Wordpress onto a new framework with a custom CMS.\n●      Deliver projects to agreed deadlines, in good quality and after thorough testing.\n●      Problem-solve any issues with the site, including diagnosing and correcting any bugs.\n●      Maintain and improve the operations and speed of the website in its current form.\n●      Apply technical SEO best practices to improve site speed and performance.\n●      Able to work either alone or in a small team.\n●      Able to communicate effectively with the other team members, both developers and non-developers.</p>\n<p>Key Requirements:</p>\n<p>●      5 years+ experience in development, testing, and deployment of web applications.\n●      Comfortable with custom-coding new applications without reliance on plug-ins.\n●      Knowledge and experience of all stages of web development.\n●      Extensive development experience using PHP, HTML5, Javascript, Java.\n●      Optional experience in C, C++, Ruby, React, Python, and microservices.\n●      Enjoy problem-solving.\n●      Self-motivated and able to work on your own initiative.\n●     Fluent or native level of English language is necessary.\n●     Excellent communication skills, especially in understanding requirements and explaining technical or complex concepts.</p>\n<p>Sounds interesting? Click APPLY to send your CV including examples of your works for immediate consideration.</p>\n<p>Candidates with previous experience in and job titles including; PHP Developer, HTML5 Developer, Javascript Engineer, Java Developer, C++ Developer, Python Developer, Ruby Developer, C Developer, Full Stack Developer, Git, Web Developer, Full Stack Web Development, Laravel, CSS Developer, PHP Engineer, Web Developer Full Stack Web Development may be considered.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:hello@masandpas.com\">hello@masandpas.com</a> together with links to 5 examples of your work.</p>\n",
        "company_logo": null
    },
    {
        "id": "86c8ea47-ce0f-4a32-99e9-c6ece94e0516",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/86c8ea47-ce0f-4a32-99e9-c6ece94e0516",
        "created_at": "Fri Feb 12 12:28:26 UTC 2021",
        "company": "Lampenwelt GmbH",
        "company_url": "https://www.lampenwelt.de/",
        "location": "Berlin",
        "title": "Senior Full-Stack Developer (m/w/x) 100% Remote",
        "description": "<p>Suchst du eine neue, spannende Herausforderung? Eine Anstellung mit starken Entwicklungsmöglichkeiten in einem der führenden Online-Unternehmen Deutschlands? Persönliche und berufliche Entfaltungsmöglichkeiten?</p>\n<p><a href=\"http://lampenwelt.de/\">Lampenwelt.de</a> gehört zu den führenden E-Commerce Unternehmen Deutschlands und ist unter den Online-Spezialisten in seiner Branche <strong>Marktführer</strong> und Benchmark in Europa. Wir sind in <strong>17 europäischen Ländern</strong> aktiv. Mit einem Team von aktuell <strong>über 500 Mitarbeitern aus 25 Nationen</strong> schreiben wir die Erfolgsgeschichte von Lampenwelt fort – und brauchen Verstärkung.</p>\n<p><strong>Deine Aufgaben:</strong></p>\n<ul>\n<li>contribute in architecture and other fundamental discussions</li>\n<li>implement assigned stories using the architecture and technology chosen by the team</li>\n<li>transform design layouts into state of the art mobile-first applications under consideration of our code guidelines</li>\n<li>taking care of APIs, connections to third party tools</li>\n<li>create high quality, reusable and resilient code</li>\n<li>explore and evaluate new technologies and frameworks</li>\n<li>implement all required tests to meet the „Definition of Done\"</li>\n<li>help and train other engineers on their technical tasks</li>\n</ul>\n<p><strong>Du bringst mit:</strong></p>\n<p>As a web developer by heart you:</p>\n<ul>\n<li>have a solid understanding of modern web architecture and advanced experience in a web framework like next.js, react, vuejs, node/nestjs, but also Ruby on Rails, Elixir or Phoenix</li>\n<li>have relevant experience in developing large web applications (preferably for e-commerce)</li>\n<li>have knowledge of cloud computing and how to write software in IAAS/PAAS mode</li>\n<li>have knowledge in event-drive / microservice architecture is advantageous</li>\n<li>have knowledge in test automation and CI/CD</li>\n<li>are looking for a place where you can challenge yourself, thrive and make your work time count</li>\n<li>have experience in stakeholder and time management</li>\n<li>have a deep understanding of agile work and use the know how to organize work around stories and tasks</li>\n<li>are proactive, self-reliant, self-reflective and assertive</li>\n<li>have 5-6 years of work experience</li>\n</ul>\n<p><strong>Wir bieten:</strong></p>\n<p><strong>Homeoffice</strong></p>\n<ul>\n<li>Homeoffice regulation</li>\n</ul>\n<p><strong>Employee discounts</strong></p>\n<ul>\n<li>Special conditions on our product range</li>\n</ul>\n<p><strong>FlexWork</strong></p>\n<ul>\n<li>Possibility of flexitime</li>\n</ul>\n<p><strong>Individual development opportunities</strong></p>\n<ul>\n<li>Individual training</li>\n</ul>\n<p><strong>JobBike</strong></p>\n<ul>\n<li>Contribution to your own dream bike</li>\n</ul>\n<p><strong>Sports and fitness offers</strong></p>\n<ul>\n<li>Special conditions for Lampenwelt employees in all fitness studios</li>\n</ul>\n<p><strong>Entrepreneurial atmosphere</strong></p>\n<ul>\n<li>Company events and high appreciation of employees</li>\n</ul>\n<p><strong>Team spirit</strong></p>\n<ul>\n<li>Meet for coffee with our CEO? Participate in the company's own running or soccer group? We live and breathe togetherness!</li>\n</ul>\n<p><strong>Dein Ansprechpartner:</strong></p>\n<p><strong>Melissa Barnes</strong></p>\n<p>+49 6642-406 99 9930\n<a href=\"mailto:melissa.barnes@lampenwelt.de\">melissa.barnes@lampenwelt.de</a></p>\n<p>Wir freuen uns auf deine aussagekräftigen Bewerbungsunterlagen!\n<strong>Bewerbungen bitte online unter dem Button \"Bewerben\" einreichen!</strong></p>\n<p><img src=\"https://camo.githubusercontent.com/5802eb011c2355537029d1f0c484d96819a43a06/68747470733a2f2f742e676f686972696e672e636f6d2f682f65303163643464663330333235333466663236613264393431653533653764336565393733653432616232663334333231383031646338313932373231383139\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/3b672064a26cd3f6a5903afb02306e409aa062a70f5a808f0d8f0fa9a090a605\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0NaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fbdcab71e0920a20aac57d05c2d4cf1dd50dcac2/Lampenwelt%20GmbH.jpg"
    },
    {
        "id": "efcb9d11-0c85-46ff-a593-2d9a2d290224",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/efcb9d11-0c85-46ff-a593-2d9a2d290224",
        "created_at": "Thu Feb 11 18:18:01 UTC 2021",
        "company": "unwynd.io",
        "company_url": "http://www.unwynd.io",
        "location": "Remote",
        "title": "Top-Notch Senior Full-Stack Developer (Electron.js & node.js)",
        "description": "<p>We are expanding our amazing team and looking for a top-notch <strong>5yr+ Full Stack Developer</strong> to join our team on a remote basis.</p>\n<p>We are building the very first text editor powering fully digitized documents in a dedicated project environment bringing structure to unorganized content to harness the power of hidden insight.</p>\n<p>You should be comfortable around both backend and frontend languages and frameworks as you will have the opportunity to work through our entire stack, from the backend API to the web and desktop App.</p>\n<p><em>Requirements:</em></p>\n<ul>\n<li>Strong knowledge of JavaScript web frameworks such as node.js, react.js, vue.js, electron.js, chromium, etc. (ideally electron &amp; chromium)</li>\n<li>Strong knowledge of frontend technologies such as HTML, CSS and LESS</li>\n<li>Good knowledge of database management such as MySQL and Postgres</li>\n<li>Knowledge of REST API concepts</li>\n<li>Proficient understanding of Git</li>\n<li>Passion for writing clean code, making use of coding standards and design patterns</li>\n</ul>\n<p><em>You will stand out if you have:</em></p>\n<ul>\n<li>Experience working on Add-Ons for VSCode or Atom.io</li>\n<li>Experience working with ReactJS and/or React Native</li>\n<li>Experience working with richly formatted text (.docx, .xlsx, etc.)</li>\n<li>Comfortable writing unit tests</li>\n<li>Familiarity with Docker</li>\n<li>Familiarity with AWS</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume/CV to <a href=\"mailto:contact@unwynd.io\">contact@unwynd.io</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdldZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c393a347d629cad343fbb97c300ffd14b8899166/linkedin-logo_2.png"
    },
    {
        "id": "b3ae353e-29b9-4c4a-95bc-c5279ac06063",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b3ae353e-29b9-4c4a-95bc-c5279ac06063",
        "created_at": "Thu Feb 11 11:15:51 UTC 2021",
        "company": "Livello GmbH",
        "company_url": "https://www.livello.com/technologies",
        "location": "Düsseldorf",
        "title": "Lead IoT Engineer - Full stack javascript software developer and solutions architect",
        "description": "<p>We are looking for an experienced technology lead with full stack Javascript and IoT experience. To lead the software team in the agile development of our web, mobile and cloud applications, IoT products, as well building efficient and scalable solutions. A hands-on role, where you will build and manage your own teams and coordinate outsourced development.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>Lead, manage and build our tech team and coordinate outsourced development as required</li>\n<li>Technical product design, solution architecture, specifications and implementation of Livello solutions</li>\n<li>Development and optimisation of innovative electronic hardware products in the IoT and embedded environment</li>\n<li>Strong understanding of IoT business and products to support planning and structuring of development</li>\n<li>Development of modern Javascript-based applications in the front and back-end</li>\n<li>Quality assurance of the software through planning, creation and execution of tests</li>\n<li>Work with a cross-functional team to define, build, test, and deploy universal applications</li>\n<li>Version control with Git is part of your daily work and continuous integration</li>\n<li>Ensure the implementation of technical standards and best practices</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Master in Computer Science or comparable field of study</li>\n<li>5+ years of experience in leading technical teams, designing, architecture and implementation of technical systems</li>\n<li>Strong understanding of IoT business and products to support planning and structuring of development</li>\n<li>Full Stack experience with JavaScript, React, GraphQL, Node.JS, Nest.js, TypeScript</li>\n<li>State management solutions (Redux, -Saga)</li>\n<li>Test and deployment automations: gitlab, fastlane, jest,</li>\n<li>IoT-to-Cloud managed services including device to backend data flow and device control, IoT device management, Microservices, Kubernetes and Docker on GCP</li>\n<li>Microservices, Kubernetes and Docker on GCP, Microservice messaging architecture experiences (preferred with RabbitMQ)</li>\n<li>IoT device management and mConcepts, Deployment and maintenance of cloud message brokers like AMQP or MQTT</li>\n</ul>\n<p><em>Nice to have and highly desired</em></p>\n<ul>\n<li>Understanding of containerized applications and container management on the edge</li>\n<li>Firmware development for microcontrollers (RTOS based) and edge communications like Bussystems, serial interfaces</li>\n<li>Basic knowledge and understanding of low range wireless technologies (Bluetooth, Wifi Mesh)</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>ESOP Shares</li>\n<li>A leading position in a fast growing and highly innovative start-up</li>\n<li>Young, agile and diverse team with colleagues from all over the world</li>\n<li>Open work environment with flat hierarchies and short decision-making paths</li>\n<li>Cool office in a prime location with lots of shopping/restaurant options nearby</li>\n<li>Advanced technology stack leveraging newest IoT hardware and software</li>\n<li>Plenty of creative freedom for own ideas, projects and personal development</li>\n<li>Free coffee, water, food, fruits and snacks on regular basis</li>\n</ul>\n<p><strong>Our technology:</strong></p>\n<p>Livello is building the future of autonomous retail and smart inventory management. We are developing a revolutionary IoT Platform and telemetric Smart Kiosks with state-of-the-art smart shelving and monitoring technology, leveraging newest concepts and engineering principles like automation, autoscaling, resilience, real time monitoring, sensor fusion, computer vision, machine learning and deep analytics. Our stack consists of modern Javascript, Typescript, Node.Js, React &amp; Redux, Docker, containers, client libraries, GraphQL, all built on a microservice-based kubernetes architecture, supported by the Google Cloud Platform. We strongly believe in the power of CICD and integrate and deploy our applications with modern CICD tools from Gitlab.</p>\n<p>Our mission is to give people easy and fast access to healthy food and other daily necessities - whereever and at any time of the day.</p>\n<p>We want to to setup Livello Smart Kiosks whereever people work, live and play.</p>\n",
        "how_to_apply": "<p><a href=\"https://livello.join.com/jobs/1880129-technology-lead-iot-startup-full-stack-software-hardware-embedded?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=technology%2Blead%2B-%2Biot%2Bstartup%2Bfull%2Bstack%2Bsoftware%2Bhardware%2Bembedded\">https://livello.join.com/jobs/1880129-technology-lead-iot-startup-full-stack-software-hardware-embedded?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=technology%2Blead%2B-%2Biot%2Bstartup%2Bfull%2Bstack%2Bsoftware%2Bhardware%2Bembedded</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWlZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--743c3294113248619b6bf2278a2a90ef559d907c/2547101_original.jpg"
    },
    {
        "id": "11f4ce0e-3ee7-4474-b6f9-b1207307ff76",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/11f4ce0e-3ee7-4474-b6f9-b1207307ff76",
        "created_at": "Thu Feb 11 01:35:46 UTC 2021",
        "company": "Mitrais",
        "company_url": "https://www.mitrais.com/",
        "location": "Indonesia",
        "title": "C++ Senior Engineers required for world-class Australian Software projects",
        "description": "<p>Mitrais has engaged a large Australian software company on exciting software development projects. Our customer IR is an ASX listed organization (ASX:IRI), servicing over 1,000 organizations globally including over 25% of the Global Fortune 500 companies. IR develops and offers products providing visibility over systems that people can’t live without – systems that allow them to conduct millions of financial transactions every day and collaborate using unified communications ecosystems and contact centers. IR creates software that enables organizations to use data to optimize these systems.</p>\n<p>Working on IR projects will provide you with an indescribable challenge, experience, and exposure from both technical and personal perspectives.</p>\n<p>What will you be doing?\nAt Mitrais, you will be collaborating with your  colleagues and the client to maintain, enhance, develop and deliver a series of systems that include (but not limited to):</p>\n<ul>\n<li>IR Collaborate – a Unified Communications collaboration suite that offers enterprise-grade performance management across voice, video, and collaboration ecosystems. This can be on-premises, in the cloud, or hybrid;</li>\n<li>IR Transact – a solution that simplifies the complexity of managing modern payments ecosystems. Bringing real-time visibility to the client’s entire payments environment. Transact uncovers unparalleled insights into transactions and helps clients streamline the payments experience, turning data into intelligence;</li>\n<li>IR Infrastructure– an end-to-end infrastructure monitoring solution; and</li>\n<li>AWS Simple Email Service management.</li>\n</ul>\n<p>What’s in it for you?\nWork with world class Software Engineers in an organization that is conducting world class projects.</p>\n<p>You will get the ability to modularize the serverless project and deploy it into AWS. You will also gain experience in new technologies, such as:</p>\n<ul>\n<li>Snowflake, Dynamo DB.</li>\n<li>“Cloud Native” which is the future trend/modern way of software development (application/architecture/paradigm)</li>\n<li>Unit Testing</li>\n</ul>\n<p>What skills do you need to have?\nIf you are a C++ Engineer, you will have:</p>\n<ul>\n<li>Worked with C++ 11 or newer versions for 2 years or more; and</li>\n<li>Experience in C++ technologies such as standard library, STL containers, algorithms, dynamic polymorphism and C++ specific notions, such as friend classes</li>\n</ul>\n<p>If you have exposure to any of the following then that will be a big plus.</p>\n<ul>\n<li>SNMP, WMI, web services, HTTP listener, perfmon gatherer, networking (TCP/UDP), and parsers;</li>\n<li>Mainly using typescript;</li>\n<li>Frontend using React JS, styled-component, redux-saga, Ant Design, etc;</li>\n<li>Jenkins as CI/CD;</li>\n</ul>\n<p>What can Mitrais offer you?</p>\n<ul>\n<li>We will offer you a career, not just a job!;</li>\n<li>Competitive salary;</li>\n<li>Excellent working environment, with the possibility to relocate to our regional offices and working remotely;</li>\n<li>Free English classes; English is our working language;</li>\n<li>Lots of opportunities to improve your competencies on our technical boot camps, certification programs, and soft skills training courses;</li>\n<li>Hackathons with big prizes; and</li>\n<li>Take a break with Happy Hours, Billiard Tables, gaming rooms, and free drinks and snacks to keep you 100% effective.\n*Working from home during pandemic</li>\n</ul>\n<p>Learn about life at Mitrais from our current team by searching #mitraislife on Facebook, LinkedIn, or Instagram. Fill out the form below to apply.</p>\n",
        "how_to_apply": "<p>Fill out this form to apply\n<a href=\"https://bit.ly/3qekdmO\">https://bit.ly/3qekdmO</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdCtZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--499f04f55817f9019a97ff0df76b51f1b7d5fc8f/mitrais%20IR.JPG"
    },
    {
        "id": "e13be5b4-9039-408f-9b88-3327bac37f70",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e13be5b4-9039-408f-9b88-3327bac37f70",
        "created_at": "Wed Feb 10 16:28:03 UTC 2021",
        "company": "Basil Systems",
        "company_url": "http://www.basilsystems.com",
        "location": "Remote",
        "title": "Front-end Engineer",
        "description": "<p>Basil Systems is a healthcare-focused start-up delivering a SaaS application that leverages product, market and regulatory data to support all types of players in the medical device and pharmaceutical industries.  Our goal is to help our customers deliver safe and innovative healthcare products to patients and consumers, while reducing the time to get to market.  After 14 months of stealth development, we soft launched in late December 2020 to a very positive market reception and customers.</p>\n<p>In short, Basil is a funded, revenue generating, and growth-oriented company – and we are actively seeking talented developers as we expand our engineering team.  As a front-end engineer you'll play a vital role in the ongoing design and development of our app, noticing every detail without losing sight of the big picture.</p>\n<p><strong>Front-end Engineer</strong></p>\n<p>We are looking for a motivated self-starter; you’ll spend your time building reliable front-end experiences. We would like you to have:</p>\n<ul>\n<li>3+ years of professional experience as a front-end engineer</li>\n<li>Advanced proficiency in building modern web applications with Java Script</li>\n<li>Created displays of proprietary data using D3 or related libraries</li>\n<li>Demonstrated efficient use of APIs (REST/JSON) for data transfer and business processes</li>\n<li>Up-to-date knowledge of React and Typescript</li>\n<li>Experience integrating third party component libraries</li>\n</ul>\n<p>Not all of these are required, but ideally you have experience with:</p>\n<ul>\n<li>Building complex custom interface components</li>\n<li>Using software configuration management (SCM) tools (e.g. Git, Subversion) for software development</li>\n</ul>\n<p>Some nice to haves</p>\n<ul>\n<li>Demonstrated ability to improve code quality through writing unit tests, automation and performing code reviews</li>\n<li>Built scalable code bases with an emphasis on performance</li>\n<li>Experience with containers (Docker/Kubernetes) and the AWS ecosystem</li>\n<li>Interest in providing visualizations of ML-driven or algorithmic data</li>\n</ul>\n<p><strong>Finally</strong>\nWe are a distributed team headquartered in Boston, with an office in Nashville, TN.  However, our culture allows flexibility as to when, where and how you work best – and actively employ and support remote engineers.</p>\n<p>Benefits include:</p>\n<ul>\n<li>Competitive salary (Depending upon experience, range from $80k - $155k)</li>\n<li>Health and vision</li>\n<li>An attractive equity package</li>\n</ul>\n<p>Basil supports and encourages building a work environment that is diverse, inclusive, and safe for everyone -- and we welcome all applicants.  Contact us at: <a href=\"mailto:jobs@basilsys.com\">jobs@basilsys.com</a></p>\n",
        "how_to_apply": "<p><a href=\"mailto:jobs@basilsys.com\">jobs@basilsys.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczJZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--620133d535fb722eaafc849318e1ad8e06aecf8c/website_logo_transparent_background.png"
    },
    {
        "id": "4ff37f66-7449-4671-a5de-667f737a367c",
        "type": "Contract",
        "url": "https://jobs.github.com/positions/4ff37f66-7449-4671-a5de-667f737a367c",
        "created_at": "Wed Feb 10 14:18:23 UTC 2021",
        "company": "Svensk Coding Company AB",
        "company_url": "https://www.thecodingcompany.se",
        "location": "Sweden",
        "title": "PHP developer with Laravel and/or Phalcon skills",
        "description": "<p>Senior level of Laravel skills. Phalcon skills would be great.</p>\n<p>You enjoy working with scrum/agile.\nYou work organized and professionally.\nYou can solve complex problems but are not afraid of asking.\nYou experienced with Docker\nYou are experienced with ReactJS, Bootstrap CSS and possibly VUE</p>\n",
        "how_to_apply": "<p>E-mail your resume, a motivation letter and 2 references.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1NZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--98256e8f95351e64884631fc37a970820e0860f5/logo-427x350.jpg"
    },
    {
        "id": "922cda48-f1ed-45e7-b95f-fed1210a98b1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/922cda48-f1ed-45e7-b95f-fed1210a98b1",
        "created_at": "Tue Feb 09 16:06:52 UTC 2021",
        "company": "http://metrica-sports.com/",
        "company_url": "http://metrica-sports.com/",
        "location": "Remote (UTC-4 to UTC+2)",
        "title": "Full Stack Engineer",
        "description": "<p>Metrica Sports is on a mission to provide best in class performance analysis solutions to clubs, teams and players at all levels of the game (from world class champions to amateur teams). We are passionate not only about sports and the impact they have in society, but also about the products we build and the customers we provide solutions for. If you share these values and are an experienced full-stack developer we want to hear from you!</p>\n<h2>At Metrica Sports you will:</h2>\n<ul>\n<li>Be a part of a small and highly skilled team focused on developing high quality software for data and video analysis.</li>\n<li>Plan and develop new backend services and adapt the existing ones using NodeJS, MongoDB, Redis, etc.</li>\n<li>Design and implement performant, maintainable and reusable code for our frontend projects using React, Redux, CSS, etc.</li>\n<li>Analyze existing codebase and come up with alternatives and improvements to meet new requirements in our products.</li>\n<li>Own your work from development to production and ensure its quality, maintainability, supportability and security.</li>\n<li>Inspire fellows with your creativity and knowledge sharing.</li>\n<li>We are an all remote company (time-zones between Eastern Time and Central European time).</li>\n</ul>\n<h2>Who we are looking for:</h2>\n<ul>\n<li>You are intrinsically curious, like to research new technologies and constantly want to learn and improve.</li>\n<li>You are highly collaborative, love to share your knowledge and want to work on a small and dynamic team.</li>\n<li>You have a startup spirit and like to work on fast paced environment.</li>\n</ul>\n<h2>You are a good fit if:</h2>\n<ul>\n<li>You have 5+ years of experience working as a full-stack engineer.</li>\n<li>You are comfortable using NodeJS and understand the concepts of modern RESTful development.</li>\n<li>You have a solid foundation of system design principles, data structures and algorithms.</li>\n<li>You have experience working with database systems (e.g. MongoDB, Redis, etc.).</li>\n<li>You have experience using modern JS frontend frameworks (e.g. React, Redux, etc.).</li>\n<li>You have experience with AWS infrastructure or similar, creating auto-scalable solutions and automating CI/CD pipelines.</li>\n<li>You are self-driven, value autonomy and are committed to ship high quality code.</li>\n<li>You have an analytical mind and great attention to details.</li>\n<li>Fluent in written and spoken English.</li>\n</ul>\n<h2>We would value:</h2>\n<ul>\n<li>Bachelor's degree in Computer Science, Engineering or equivalent experience.</li>\n<li>Experience optimizing performance and costs in a cloud architecture.</li>\n<li>Experience handling servers and data in different regions.</li>\n<li>Experience using Electron or related frameworks.</li>\n<li>Experience coding in Typescript, C++ and/or Python.</li>\n</ul>\n<h2>To apply:</h2>\n<ul>\n<li>Please apply <a href=\"https://apply.workable.com/metrica-sports/j/28240165A3/apply/\">here</a>. We won't consider email applications.</li>\n<li>We do not accept solicitations by recruiters, recruiting agencies, head hunters and/or outsourcing organizations.</li>\n</ul>\n<h2>Hiring process:</h2>\n<ol>\n<li>Applications reviewed by team lead and CTO, this process could involve a quick intro call (15mins)</li>\n<li>Technical interview with team lead. We will ask you to prepare a review of code you have worked on that you are particularly proud of, or think it's interesting to discuss. (1h)</li>\n<li>Interview with CTO. (1h)</li>\n<li>Reference calls.</li>\n<li>Interview with CEO. (1h)\nOffer.</li>\n</ol>\n",
        "how_to_apply": "<p>Apply through this link: <a href=\"https://apply.workable.com/metrica-sports/j/28240165A3/apply/\">https://apply.workable.com/metrica-sports/j/28240165A3/apply/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTJZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--593e9b64013a79e6c7b3ad4be4ae7025e5a944cd/Icon_verde%20transp.png"
    },
    {
        "id": "d8b84083-19f4-41dd-9ea7-e77d27ef2dc1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d8b84083-19f4-41dd-9ea7-e77d27ef2dc1",
        "created_at": "Tue Feb 09 15:01:51 UTC 2021",
        "company": "Cubbit",
        "company_url": null,
        "location": "Open to remote work for CET / Headquarter in Bologna, Italy",
        "title": "Full Stack Developer",
        "description": "<p><strong>We not only apply cutting-edge technology. We create it.</strong></p>\n<p>Cubbit works as a <em>distributed data center</em>, where a swarm of individual devices, orchestrated by a coordinator super-node, cooperate to virtualize a cloud storage service.</p>\n<p>Our team is growing and <strong>we’re looking for a Full Stack Developer</strong> to join <em>‘The Swarm’</em></p>\n<p><strong>What you will do:</strong></p>\n<ul>\n<li>Develop Cubbit’s software.</li>\n<li>Enrich the core software with new features.</li>\n<li>Improve Cubbit’s core performance and maintainability.</li>\n<li>Support the open source community with contributions.</li>\n<li>Support other (development) teams and individuals with your knowledge, skills, and expertise.</li>\n</ul>\n<p><strong>What you will need:</strong></p>\n<ul>\n<li>3+ years of experience.</li>\n<li>Good understanding of Object-Oriented Design and Programming.</li>\n<li>Typescript.</li>\n<li>Node.js.</li>\n<li>C++.</li>\n<li>Git.</li>\n<li>Cryptography fundamentals (Hash, Symmetric encryption, etc).</li>\n</ul>\n<p><strong>Bonus points:</strong></p>\n<ul>\n<li>Shell scripting.</li>\n<li>Electron.</li>\n<li>SQL.</li>\n<li>Docker.</li>\n<li>React/Redux.</li>\n<li>Worked in the cloud industry.</li>\n<li>Solid spoken and written English communication skills.</li>\n</ul>\n<p><strong>Your Profile and Mindset:</strong></p>\n<ul>\n<li>Independent: a highly motivated self-starter who is ready to dig in, hustle, find solutions and deliver.</li>\n<li>Data-driven:  know how to digitally engage with customers, measure their responses, define KPIs to test your hypothesis, and choose a strategy.</li>\n<li>Methodical: be efficient in reporting to founders, or sharing findings with the team.</li>\n<li>Ambitious: think big, start small, scale fast. Join us in building a born global startup.</li>\n<li>Humble: know that you don’t know, learn from the top tier, don’t reinvent the wheel.</li>\n<li>A proactive participant in our culture.</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Remote worldwide is welcome! Preference for CET-compatible time zones. An office is available at our headquarters (Bologna, IT) if needed.</li>\n<li>Periodic activities with the team, and everyday passion</li>\n<li>An international team of top-level profiles</li>\n</ul>\n",
        "how_to_apply": "<p><strong>To apply, please contact us and send your CV <a href=\"mailto:careers@cubbit.io\">careers@cubbit.io</a>.</strong></p>\n<p>Please apply even if your experience and interests aren't an exact match with what we've laid out in this job description.</p>\n<p><em>We're building something different at Cubbit.</em>\nIf that sounds interesting, we want to hear from you.</p>\n<p><strong>Discover more about Cubbit Technology:</strong> (<a href=\"https://www.cubbit.io/\">https://www.cubbit.io/</a>)</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWVZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--303d1785f23638eac7bde37d79e5a37ec0a2d941/Cubbit%20logo.png"
    },
    {
        "id": "8a172525-f2a4-46b9-8128-e251813fead3",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8a172525-f2a4-46b9-8128-e251813fead3",
        "created_at": "Tue Feb 09 11:59:46 UTC 2021",
        "company": "OBVIO",
        "company_url": "http://obv.io",
        "location": "Murrells Inlet, SC or Remote",
        "title": "Front End Developer with React and Graphic Design Experience.",
        "description": "<p>We're an live event company, that in the past 9 months, has made a hard pivot towards virtual events.  We're in the midsts of developing a platform that allows our clients to build their own event website (we call them Dashboards), customize them, and interact with our primary video streaming platform for these style of events (Zoom).  Our typical event is 3 days in length, and has 1-3k people in attendance.</p>\n<p>The websites that our platform create includes a front-end and a back-end.  The front end (attendee facing), is relatively simple, as its a blog with access to certain pieces of information, and links to various zoom meetings, based on ticket levels and other key pieces of information.  The back end includes the zoom control area, allowing our clients to manage hundreds of meetings simultaneously, as well as the ability to edit and modify the dashboard as needed.</p>\n<p>We're looking for a developer with a strong foundation and experience with React to support building out the front end user experience.  Ideally that person is strong in graphic design as well.  We have 450 beta testers enrolled in our public beta launch, scheduled for March 31, 2021, and plan on launching to a wider audience on July 1st, 2021.</p>\n<p>In addition to React, the following skills are an asset.</p>\n<p>PHP, Javascript, CSS, HTML\nLaravel Framework\nReact JS Library\nDynamo DB\nMySQL / Aurora DB\nHigh Traffic Website Code Optimization\nA strong familiarity with AWS services, and how they interact with each other is also asset.</p>\n<p>Position to start immediately.</p>\n",
        "how_to_apply": "<p>Visit <a href=\"https://careers.hireology.com/sage/421535/description\">https://careers.hireology.com/sage/421535/description</a></p>\n",
        "company_logo": null
    },
    {
        "id": "44ebbf1b-89cb-48c3-9102-5e385db18810",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/44ebbf1b-89cb-48c3-9102-5e385db18810",
        "created_at": "Tue Feb 09 09:16:27 UTC 2021",
        "company": "Wärtsilä",
        "company_url": "https://careers.wartsila.com/search/?createNewAlert=false&q=&optionsFacetsDD_title=&optionsFacetsDD_country=NL&optionsFacetsDD_customfield2=&optionsFacetsDD_customfield1=&optionsFacetsDD_customfield3=",
        "location": "Drunen, Netherlands",
        "title": "Front-End Developer",
        "description": "<p><em>Are you a Front-end Developer and happen to ask yourself how can your work help in this global environmental challenge that we all are facing? Join a team of more than 80 international professionals that are creating the most innovative predictive tools for the maritime industry. Help our Digital Development team in shaping a platform that focuses on detecting anomalies that indicate potential failures or reveal conditions involving the consumption of excess fuel. You will build great solutions that will ultimately help our customers in saving energy and resources while gaining safety.</em></p>\n<p>Our DPD (Digital Product Development) organization develops digital products for Wärtsilä business units in Marine Power, Marine Systems and Energy. DPD uses a common technology stack to generate insight from operational data, to make for example predictive maintenance- or efficiency optimization products such as Wärtsilä Expert Insight. Our organization is growing from around 100 to 120 professionals, which is why we are looking for 4 Front-end developers to join our team.</p>\n<p>As a Front-end Developer you will work together with other developers on web-based software that is used both internally and externally, giving domain experts and customers insights into their operation and helping them in their day-to-day jobs. Besides working on the user-facing parts you will also contribute to the internal technical, shared packages and tooling to improve the quality of life for yourself and your peers, therefor affinity for both the technical and visual side of front-end development is desired.</p>\n<p>Our DPD organization consists of around 15 agile teams organized in 4 tribes, with clear focus areas, led by Chief Product Owners. As a front-end developer you will be part of one of the agile teams and will develop and maintain our digital products.</p>\n<p>These are permanent positions and would preferably be located at our office in Drunen, Netherlands</p>\n<p><strong>As a Front-end Developer your work will focus on these responsibilities:</strong></p>\n<ul>\n<li>You build and develop our new responsive web app that works well on a variety of screen resolutions and browsers.</li>\n<li>You develop new features for our products and services which provide our customers with actionable information through multiple channels.</li>\n<li>You participate in end to end development through prototyping, validation, implementation, launch, and further iterations.</li>\n<li>You actively contribute to continuous integration efforts and improvements on our way of working.</li>\n<li>You collaborate with UX designers to develop appealing and intuitive interfaces based on graphic designs or mock-ups.</li>\n</ul>\n<p><strong>To be successful in this role we expect you to have:</strong></p>\n<ul>\n<li>You have a Bachelor or Master’s degree in Computer Science or at least 3 years of relevant experience with front-end-development specifically: JavaScript (including ESNext and/or TypeScript), HTML5, CSS and/or Sass.</li>\n<li>Experience with and/or skills in UX design/development; you're able to create an aesthetically pleasing and user experience friendly interface based on (or without any) minimal mock-ups.</li>\n<li>Experience with React or similar technologies like Angular or Vue.js.</li>\n<li>Experience with automated unit, visual, and/or contract testing, we use Jest for this.</li>\n<li>Experience with back-end development (e.g. Java, Python) or experience working with BaaS (e.g. Firebase) is a plus.VOl</li>\n<li>Experience developing online applications, especially those containing a lot of data, is a plus.</li>\n</ul>\n<p><strong>Why you and us</strong></p>\n<p>We have an amazing team and a clear purpose to exist. As part of the Digital Product Development Team you will be an integral part in the development of digital products and tools across our business’ and will be key in unlocking the value of operational data all to enhance our performance-based business and support the growth of our lifecycle solutions business. Both our Digital Product Development teams in Drunen and Helsinki fosters an inclusive high-performance culture that people enjoy working in.</p>\n<p>We are passionate about the work we do and hope to find a colleague with a shared passion for smart technologies and a sustainable future.</p>\n<p>We offer a competitive salary and promote a healthy work life balance. We foster openness, respect and trust.</p>\n<p>All our employees are encouraged to utilise the variety of training activities, learning solutions and self-study materials that we have to offer which supports the opportunity to further develop your talents and competencies within a very global working environment, in an ambitious and growth orientated organisation.</p>\n<p><strong>Contact &amp; next steps</strong></p>\n<p>Does this sound like the job for you? If yes, we hope to hear from you before the application deadline 02-03-2021, through submitting your application through our careers portal.</p>\n<p>In case you have questions about the process please contact Dré Schellekens (Corporate Recruiter) by email: <a href=\"mailto:dre.schellekens@wartsila.com\">dre.schellekens@wartsila.com</a></p>\n",
        "how_to_apply": "<p>Apply via our career portal or send an e-mail to <a href=\"mailto:dre.schellekens@wartsila.com\">dre.schellekens@wartsila.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fcfe3e70ea2235e975d7effe75d1e70103154f7c/NEW_wartsila-rgb150.jpg"
    },
    {
        "id": "980f561f-9497-4979-835c-137d94ead31d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/980f561f-9497-4979-835c-137d94ead31d",
        "created_at": "Mon Feb 08 13:38:43 UTC 2021",
        "company": "Gorgias",
        "company_url": "https://www.gorgias.com/",
        "location": "Paris",
        "title": "Senior Front-End Engineer ReactJS",
        "description": "<p><a href=\"http://gorgias.com/\">Gorgias</a> helps e-commerce companies deliver excellent customer service at scale.</p>\n<p>Our product creates a unified profile of customers by combining emails, live-chat, and social-media messages with e-commerce data such as purchase and delivery info.</p>\n<p>Combining all this data in a single application makes customer service more efficient and just better. Another fortunate side-effect is that some requests are completely automated using ML. 💬 + 📦 = ❤️</p>\n<p>We've been around since 2015, and we're currently serving over <strong>5000+</strong> e-commerce businesses, including Steve Madden, and Timbuk2.</p>\n<p>This position is either fully remote (Central European timezones) or onsite at our Paris office (75011). For europeans, we offer a relocation package for you and each family member. :)</p>\n<h3>Join us! Resistance is futile!</h3>\n<ul>\n<li>You'll fit right in if you care about working on applications that are putting the customer needs first. At Gorgias, we work hard, so our customers have an easier job! We also like working with people that \"get stuff done\" and are confident about pushing their code to production many times a day. You're also one of those people that cares about becoming a better engineer and human every day. Learning never stops; we help each other get better!</li>\n<li>If getting your hands dirty in a real-world application that touches the lives of millions is your thing, then yeah, Gorgias is for you.</li>\n</ul>\n<h3>About the Self Serve team</h3>\n<ul>\n<li>Work with our newest team to build a set of empowering self-service features for our end users (our customer's customer).</li>\n</ul>\n<p>As an example of current projects:</p>\n<ul>\n<li>a live chat with automated interactions for common requests (track orders, return order, cancel order...)</li>\n<li>a dashboard where end users can follow progress on all their orders, submit issues...</li>\n<li>a help center that will enable end users to solve most of their problems on their own</li>\n</ul>\n<p>The tools we build will eventually be installed and used by thousands of shops around the world and billions of end-users!</p>\n<p>As for technologies we use:</p>\n<ul>\n<li>ReactJS with Typescript</li>\n<li>Websocket and NodeJs workers</li>\n<li>Kubernetes</li>\n</ul>\n<h3>About You</h3>\n<ul>\n<li>3+ years of experience working with ReactJS</li>\n<li>You've shown some level of ownership in previous roles/projects and love to tear down roadblocks alongside a collaborative team</li>\n<li>You've worked in a professional team environment</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Experience with NodeJS</li>\n<li>2+ years of experience with TypeScript</li>\n<li>Experience writing in Python or comfortable reading documentation in Python</li>\n<li>Experience with WebSocket</li>\n<li>Experience working on live chat features or products is a big plus!</li>\n</ul>\n<h3>More info about the company:</h3>\n<ul>\n<li>Raised our series A in November 2019: <a href=\"https://techcrunch.com/2019/11/26/gorgias-series-a/\">techcrunch.com/2019/11/26/gorgias-series-a</a>\n</li>\n<li>Raised our series B in December 2020: <a href=\"https://techcrunch.com/2020/12/10/gorgias-series-b/\">https://techcrunch.com/2020/12/10/gorgias-series-b/</a>\n</li>\n<li>What our customers are saying: <a href=\"https://apps.shopify.com/helpdesk#reviews\">apps.shopify.com/helpdesk#reviews</a>\n</li>\n<li>Our software stack: <a href=\"https://stackshare.io/gorgias\">stackshare.io/gorgias</a>\n</li>\n<li>Other positions: <a href=\"https://jobs.lever.co/gorgias\">jobs.lever.co/gorgias</a>\n</li>\n</ul>\n<h3>Company Perks &amp; Benefits</h3>\n<ul>\n<li>Competitive salary, equity packages, and performance bonus packages</li>\n<li>5 weeks of vacation and parental leave</li>\n<li>Latest MacBook Pro or equivalent</li>\n<li>Natural sunlight and open office with lounge area</li>\n<li>Relocation package for you and your family</li>\n<li>Complementary health coverage (Mutuelle)</li>\n<li>50% of public transportation expenses</li>\n<li>Free lunch x5 a week</li>\n</ul>\n<h3>Why join us?</h3>\n<ul>\n<li>🚀 Join a high growth tech startup at a crucial time, and with an unusually technical growth team</li>\n<li>🙏 Join a company where automation, good &amp; clean data are core beliefs shared by all</li>\n</ul>\n<h3>Engineering Team Culture</h3>\n<p>Getting Stuff Done, Ownership, Team Work, Excellence, and Agility.</p>\n<p>You should join us if you want to ship stuff fast without scarifying quality. We've put great importance on testing our code, cleaning it, treating errors first, and features later.</p>\n<p>We also value growth and ownership. People make mistakes. We learn from them to avoid them in the future. We cannot achieve excellence if there are no bumps in the road.</p>\n",
        "how_to_apply": "<p>Thanks for your interest!</p>\n<p>Please submit your application here: <a href=\"https://jobs.lever.co/gorgias/70b4cd59-3040-4c08-a2dd-90afac125e95\">https://jobs.lever.co/gorgias/70b4cd59-3040-4c08-a2dd-90afac125e95</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblNZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb99c0e7003ffe89ca10b16cc763e344f908421a/207-2077347_gorgias-logo-png-email-tool-chrome-extension-gorgias.png"
    },
    {
        "id": "0b155a82-e623-44b4-bd40-0cc3f58ac42e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0b155a82-e623-44b4-bd40-0cc3f58ac42e",
        "created_at": "Mon Feb 08 13:28:25 UTC 2021",
        "company": "Equinix",
        "company_url": "https://www.equinix.com",
        "location": "Singapore",
        "title": "Full Stack Developer - Building next-gen products and architecture",
        "description": "<p>Equinix is the world’s digital infrastructure company, operating 210 data centers across the globe and providing interconnections to all the key clouds and networks. Businesses need one place to simplify and bring together fragmented, complex infrastructure that spans private and public cloud environments. Our global platform allows customers to place infrastructure wherever they need it and connect it to everything they need to succeed.</p>\n<p>At Equinix, we help the world’s digital leaders scale with agility, speed the launch of digital services, deliver world-class experiences, and transform people’s lives. Our culture is based on collaboration and the growth and development of our teams.</p>\n<p>We hire hardworking people who thrive on solving challenging problems and give them opportunities to hone new skills, and try new approaches, as we grow our product portfolio with new software and network architecture solutions. We embrace diversity in thought and contribution and are committed to providing an equitable work environment. that is foundational to our core values as a company and is vital to our success</p>\n<p>As a key member of the Product Engineering team, you will be responsible for the end-to-end development lifecycle from the requirement, architecture, design, implementation, testing, deployment, and support with a focus on delivering solutions adhering to business goals, technical requirements, and engineering standards.</p>\n<h2>Job Responsibilities:</h2>\n<ul>\n<li>Hands-on Design, Development, Deployment &amp; Support of JavaScript based platforms, frameworks, and applications</li>\n<li>Incorporates standards and best practices, including performance, security, scalability, and maintainability</li>\n<li>Interact with Business System Analysts to design and deliver technical solutions to support various business functions</li>\n<li>Create rich web user interfaces using HTML, CSS, and JavaScript.</li>\n<li>Create server-side functionality using asynchronous, highly scalable design principles</li>\n<li>Provide thought leadership and lead innovation by exploring, investigating, recommending, benchmarking and implementing tools and frameworks.</li>\n<li>Work in a Globally Distributed Development team environment to enable successful delivery with a minimal supervision</li>\n<li>Advocate, document, and follow best design and development practices</li>\n</ul>\n<h2>It is you, if:</h2>\n<ul>\n<li>You are passionate, creative and self-driven</li>\n<li>You are curious and collaborative, and a believer in the power of teams and teamwork</li>\n<li>You are flexible and have a broad set of capabilities to wear multiple hats</li>\n<li>You thrive in a dynamic and a fast-paced environment</li>\n<li>You pursue speed and simplicity relentlessly</li>\n<li>You are a natural leader in everything you do</li>\n</ul>\n<h2>Experience:</h2>\n<ul>\n<li>BS/MS degree or equivalent with 6+ years in the field of Software Engineering and Development</li>\n<li>An obsession with customer experience, product fidelity, developer documentation, Web App ecosystem, and exceptional developer experience.</li>\n<li>Minimum 4+ years of strong hands-on development experience with JavaScript and related open source technologies</li>\n<li>Extensive experience developing and running production application in ReactJS is a must</li>\n<li>Minimum 3+ years of hands-on experience with Frameworks like Nodejs, React.js, Vue.js, Angular.js, HTML 5, CSS 3, etc.</li>\n<li>Exposure to the other frameworks and programming languages like Java, Python, Golang is a plus</li>\n<li>Working Knowledge on Reactive/Functional Programming</li>\n<li>Strong understanding of design patterns and best practices in JavaScript</li>\n<li>Good understanding of Identity concepts - SAML, JWT, OAuth etc.</li>\n<li>Experience with web servers &amp; application servers such as Apache and Nginx</li>\n<li>Working experience with Swagger (Open API Spec), OAuth, REST, JSON etc.,</li>\n<li>Experience/knowledge on Data modeling and Nodejs integration with NO-SQL technologies like Redis, Cassandra etc. is a plus</li>\n<li>Solid understanding of how to use tools like Git, Jira, and Jenkins</li>\n<li>Solid understanding of JS unit testing frameworks</li>\n<li>Proven ability to quickly grasp the implications of evolving industry trends &amp; technology intersects</li>\n<li>Exceptional communication, organization, and presentation skills</li>\n<li>Experience working within Agile or Scaled Agile Framework is required</li>\n</ul>\n<h2>Interested?</h2>\n<p>Please apply by clicking the <strong>'Application'</strong> form.</p>\n<p><a href=\"https://vonq.io/3rD3FVP\">Click here for the application form!</a></p>\n",
        "how_to_apply": "<p><a href=\"https://vonq.io/3rD3FVP\">Click here for the application form!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbStZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4ded80dc14556c616622d5a62ccfc0cfda4426bd/EQ.jpeg"
    },
    {
        "id": "ac9a629d-78ea-4d1e-822c-d01537192d48",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ac9a629d-78ea-4d1e-822c-d01537192d48",
        "created_at": "Mon Feb 08 13:24:23 UTC 2021",
        "company": "Equinix",
        "company_url": "https://vonq.io/2LxFW9W",
        "location": "Warsaw",
        "title": "Software Engineer (UI)",
        "description": "<p>Equinix is the world’s digital infrastructure company, operating 210 data centers across the globe and providing interconnections to all the key clouds and networks. Businesses need one place to simplify and bring together fragmented, complex infrastructure that spans private and public cloud environments. Our global platform allows customers to place infrastructure wherever they need it and connect it to everything they need to succeed.</p>\n<p>At Equinix, we help the world’s digital leaders scale with agility, speed the launch of digital services, deliver world-class experiences, and transform people’s lives. Our culture is based on collaboration and the growth and development of our teams.</p>\n<p>We hire hardworking people who thrive on solving challenging problems and give them opportunities to hone new skills, and try new approaches, as we grow our product portfolio with new software and network architecture solutions. We embrace diversity in thought and contribution and are committed to providing an equitable work environment. that is foundational to our core values as a company and is vital to our success.</p>\n<h2>The Role</h2>\n<p>We are looking for talented Staff Software Engineers, responsible for brand-new product development to simplify and accelerate quoting and ordering processes for Equinix’s customers. By using a modern technology stack, cloud, microservices architecture, API-first approach, micro-frontend user interface and focusing on the product quality and delightful user experience, the engineering team will be responsible for building a highly scalable, globally distributed software product. This is a hugely exciting project where you will be part of a world-class product engineering team that’s paving the path for new ways for enterprises to consume ever increasing cloud services. You will:</p>\n<ul>\n<li>Play a pivotal role in Equinix Agile Software Development Lifecycle processes</li>\n<li>Participate in Product Increment Planning to analyze business requirements and determine feasibility of design</li>\n<li>Work with product managers, product owners, analysts and other engineers to design functional architecture</li>\n<li>Lead designs of major software modules and features</li>\n<li>Develop and deploy the software</li>\n<li>Work with test automation team on test automation and validation procedures to keep high software quality</li>\n<li>Mentor other members of the team</li>\n<li>Work with product stakeholders to understand business requirements and helps interpreting ambiguous requirements</li>\n<li>Participate in architectural review process</li>\n<li>Lead product features and design software components with many dependencies</li>\n<li>Provide design that is scalable, efficient and follow best practices</li>\n<li>Set code review guidelines</li>\n<li>Develop scripts and code for a feature and multiple modules and product</li>\n<li>Develop unit tests, fixes defects, develops test strategies, recommends testing frameworks</li>\n<li>Define technical strategy and drives release management planning</li>\n</ul>\n<h2>Your Experience</h2>\n<p>We’re looking for someone who is highly curious, up to date with all the trends and technologies, and loves taking a project and owning it, demonstrating excellence in everything they do. High energy and an ability to inspire the team around them is essential! Additionally, you will have:</p>\n<ul>\n<li>BS in computer science or equivalent with 3-7 years of hands-on professional software development.</li>\n<li>UI development expertise in cloud-based application development with in-depth knowledge of JavaScript, React.js and its core principles, React.js workflows (such as Flux or Redux),</li>\n<li>Experience in micro-frontends UI architecture is a plus</li>\n<li>Should have strong skills in UI like HTML5, CSS3, CSS Preprocessors like SASS, Converting UX Mockups to UI, Automation testing, Ajax API Integrations.</li>\n<li>Experience with multiple architecture styles including SOA, API-first and micro-services architectures</li>\n<li>Real-world experience with continuous integration and delivery using public cloud such as AWS, Azure or GCP and container technologies such as Docker is required</li>\n</ul>\n<h2>Why Join Us?</h2>\n<p>You will be working on great products with access to newest technologies. We are offering stable employment with competitive salary above an average on the market and benefits including annual bonus or lunch card. Moreover, you will be eligible to participate on our employee stock units purchasing programs. And most of all- the opportunity to create unique atmosphere and company culture based on Magic of Equinix. The modern office space and Warsaw Spire view will be awaiting you, however you will be allowed to work from home according to company policy. If you are not living in Warsaw but you are still interested in being part of the team, we can support you with a relocation package.</p>\n<p>Equinix is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, colour, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with disability. We actively champion diversity with a series of networks including Black Connect, Equinix Women’s Leadership Network, and Pride Connect.</p>\n<p><a href=\"https://vonq.io/2LxFW9W\">Click here for the application form!</a></p>\n",
        "how_to_apply": "<p><a href=\"https://vonq.io/2LxFW9W\">Click here for the application form!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbW1ZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e115af6bf76715d0a859b680a023829e6c93f1bf/companyLogo-Equinix%20Tagline%20Outlined_300.jpg"
    },
    {
        "id": "be0ff9d6-8885-48bf-bd6f-1fc9d5cf5732",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/be0ff9d6-8885-48bf-bd6f-1fc9d5cf5732",
        "created_at": "Mon Feb 08 11:48:54 UTC 2021",
        "company": "Equinix",
        "company_url": "https://www.equinix.com",
        "location": "Warsaw",
        "title": "Senior Software Engineer (Full-Stack)",
        "description": "<h2>Senior Software Engineer (Full-stack)</h2>\n<p>Equinix is the world’s digital infrastructure company, operating 210 data centers across the globe and providing interconnections to all the key clouds and networks. Businesses need one place to simplify and bring together fragmented, complex infrastructure that spans private and public cloud environments. Our global platform allows customers to place infrastructure wherever they need it and connect it to everything they need to succeed.</p>\n<p>At Equinix, we help the world’s digital leaders scale with agility, speed the launch of digital services, deliver world-class experiences, and transform people’s lives. Our culture is based on collaboration and the growth and development of our teams.</p>\n<p>We hire hardworking people who thrive on solving challenging problems and give them opportunities to hone new skills, and try new approaches, as we grow our product portfolio with new software and network architecture solutions. We embrace diversity in thought and contribution and are committed to providing an equitable work environment. that is foundational to our core values as a company and is vital to our success.</p>\n<h2>The Role</h2>\n<p>We are looking for talented Staff Software Engineers, responsible for brand-new product development to simplify and accelerate quoting and ordering processes for Equinix’s customers. By using a modern technology stack, cloud, microservices architecture, API-first approach, micro-frontend user interface and focusing on the product quality and delightful user experience, the engineering team will be responsible for building a highly scalable, globally distributed software product. This is a hugely exciting project where you will be part of a world-class product engineering team that’s paving the path for new ways for enterprises to consume ever increasing cloud services. You will:</p>\n<ul>\n<li>Play a pivotal role in Equinix Agile Software Development Lifecycle processes</li>\n<li>Design major software modules and features and develop scripts and code for multiple modules</li>\n<li>Develop and deploy the software</li>\n<li>Adopt of standard coding processes</li>\n<li>Work on cross-technical integration</li>\n<li>Work with test automation team on test automation and validation procedures to keep high software quality</li>\n<li>Develop unit tests, fixes defects</li>\n<li>Mentor other members of the team</li>\n<li>Provide status of the work in a timely manner</li>\n<li>Investigate, analyze, and evaluate new technologies</li>\n</ul>\n<h2>Your Experience</h2>\n<p>We’re looking for someone who is highly curious, up to date with all the trends and technologies, and loves taking a project and owning it, demonstrating excellence in everything they do. High energy and an ability to inspire the team around them is essential! Additionally, you will have:</p>\n<ul>\n<li>computer science diploma or equivalent with 3-7 years of hands-on professional software development experience</li>\n<li>Full Stack expertise in cloud-based application development with in-depth knowledge of java eco-system (experience with multiple frameworks such as Spring, Hibernate), JavaScript (with at least one modern framework like React/Angular/Ember), HTML5/CSS3, Node.JS and other cutting-edge technologies</li>\n<li>Expertise in data modeling, relational design using RDBMS and NoSQL such as Cassandra, MongoDB</li>\n<li>Experience with multiple architecture styles including SOA, API-first and micro-services architectures</li>\n<li>Real-world experience with continuous integration and delivery using public cloud such as AWS, Azure or GCP and container technologies such as Docker is highly desired</li>\n<li>Hands-on experience with Agile-scrum methodology and Test-driven development</li>\n</ul>\n<h2>Why Join Us?</h2>\n<p>You will be working on great products with access to newest technologies. We are offering stable employment with competitive salary above an average on the market and benefits including annual bonus or lunch card. Moreover, you will be eligible to participate on our employee stock units purchasing programs. And most of all- the opportunity to create unique atmosphere and company culture based on Magic of Equinix. The modern office space and Warsaw Spire view will be awaiting you, however you will be allowed to work from home according to company policy. If you are not living in Warsaw but you are still interested in being part of the team, we can support you with a relocation package.</p>\n<p>Equinix is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, colour, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with disability. We actively champion diversity with a series of networks including Black Connect, Equinix Women’s Leadership Network, and Pride Connect.</p>\n<h2>Interested?</h2>\n<p>Apply now via the <strong>\"Apply\"</strong> form.</p>\n<p><a href=\"https://vonq.io/38N6dd6\">Click here for the application form!</a></p>\n",
        "how_to_apply": "<p><a href=\"https://vonq.io/38N6dd6\">Click here for the application form!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVNZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--eb6ffa34b583b4c2881410d6f448b5333273a4f5/EQ.jpeg"
    },
    {
        "id": "d380e257-8618-4a95-bb52-f4d70e2de9d7",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d380e257-8618-4a95-bb52-f4d70e2de9d7",
        "created_at": "Sun Feb 07 02:20:57 UTC 2021",
        "company": "Axios",
        "company_url": "http://axios.com",
        "location": "Remote (USA)",
        "title": "Senior Mobile Engineer (React Native)",
        "description": "<p>Quick Take: Axios is a growth-stage startup dedicated to providing trustworthy, award-winning news content in an audience-first format. We are hiring a Senior Mobile Engineer! </p>\n<p>Why it Matters: Our Mobile Engineers are a critical part of our mission to deliver the cleanest, smartest, most efficient and trustworthy content to our users. You will architect and grow new and existing codebases, give technical input and feedback to Axios’ product and design teams for new features, and help develop the skills of your teammates with industry best practices around testing, accessibility, and documentation.</p>\n<p>Go Deeper: In this role, you will make an impact on Axios through the following responsibilities:</p>\n<p>Help architect and build significant new features in the Axios mobile app\nPartner with Senior Mobile, Frontend and React Native engineers on the team\nWrite clean, well-documented, and well-tested code using best practices for React and React Native development\nCollaborate with Axios’ platform, product, and design teams to ensure we quickly ship and iterate on high-quality products\nDebug and develop mobile platform-specific features on iOS and Android in a React Native codebase\nMentor and coach members of the team through pair-programming and empathetic code review\nStay up to date with industry trends and advise the team on best practices to implement</p>\n<p>The Details: Ideal candidates will embody an entrepreneurial spirit and passion for Axios’ mission and have the following skills:</p>\n<p>Experience building large, high traffic frontend codebases in React Native\nProven ability to ship high quality, testable, and accessible code quickly\nExperience working on cross-functional teams is preferred\nExperience working on mobile performance and accessibility is preferred\nExperience debugging mobile applications on iOS and Android is preferred</p>\n<p>Don’t Forget:</p>\n<p>Competitive salary\nHealth insurance (100% paid for individuals, 75% for families)\nPrimary caregiver 12-week paid leave\n401K\nGenerous vacation policy, plus company holidays\nCompany equity\nCommuter and cell phone benefit\nA commitment to an open, inclusive, and diverse work culture</p>\n<p>Additional pandemic-related benefits:</p>\n<p>One mental health day per quarter\n$100 monthly work-from-home stipend\nTele-mental health services \nOneMedical membership, including tele-health services \nIncreased work flexibility for parents and caretakers \nAccess to the Axios “Family Fund”, which was created to allow employees to request financial support when facing financial hardship or emergencies \nWeekly company-sponsored exercise and meditation classes \nVirtual company-sponsored social events</p>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/91c4e28d1us\">https://grnh.se/91c4e28d1us</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDZZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--70393a68557bb5bd04799b3ebe5f295781305424/Axios%20logo%20-%20RGB%20-%20minimum%20space.jpg"
    },
    {
        "id": "6aa71001-c8e8-4c58-9bc6-72d05cb8ba99",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6aa71001-c8e8-4c58-9bc6-72d05cb8ba99",
        "created_at": "Thu Jan 21 15:51:45 UTC 2021",
        "company": "Bounteous",
        "company_url": "https://www.bounteous.com/",
        "location": "All Locations",
        "title": "PIM Developer",
        "description": "<p>We are actively looking for a Developer to join our Data Management team! This position will be responsible for helping deliver some of our most complex PIM projects.  You will be working with a team of talented developers, leads, and architects to tackle important problems and resolve complex issues for some of the best companies and most recognizable brands on the Internet. You will be working in a distributed environment and must be able to be proactive and reach out to co-workers and clients on a regular basis.</p>\n<p>If you thrive in an environment where you are surrounded by motivated, energetic developers and technologists consider this opportunity the next step for you!</p>\n<p>Minimum Qualifications</p>\n<ul>\n<li>BA/BS in Computer Science or equivalent degree</li>\n<li>Minimum of 3-5 years PHP, object-oriented programming, MVC applications, and web development experience</li>\n<li>Minimum of 3 years of real-world e-commerce experience in the last 5 years</li>\n<li>Minimum of 3 years of Symfony development experience</li>\n<li>Familiarity with the Agile development processes, including the use of coding standards and systems for version control, build, regression testing.</li>\n</ul>\n<p>Preferred Qualifications</p>\n<ul>\n<li>Actively participated in scalable website and web application development</li>\n<li>Hands-on experience with rich web front-end development frameworks and patterns – CSS, Html, JavaScript, RWD, PWA, React, Angular, HTML5</li>\n<li>Hands-on experience designing/developing/consuming APIs (REST, GraphQL)</li>\n<li>Hands-on experience working with relational databases and writing advanced SQL</li>\n<li>Require minimal supervision and provide oversight for assigned projects</li>\n</ul>\n<p>Nice to Have's</p>\n<ul>\n<li>eCommerce platform engineering/business certifications.</li>\n<li>PIM / MDM certifications (Akeneo, Enterworks, Salsify, other major enterprise PIM platform)</li>\n<li>Other eCommerce platform experience (Magento, Shopify, Elastic path, Digital River)</li>\n<li>Exposure to Data Management platforms (PIM, MDM, DAM, ect.)</li>\n<li>CMS exposure (AEM, Drupal, etc.)</li>\n<li>Advanced PHP and JavaScript</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/bounteous/55432fdb-e57d-4288-ac9c-0c9693b7e648?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/bounteous/55432fdb-e57d-4288-ac9c-0c9693b7e648?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9a514e66d4b3bed31e386e7ab5d040b2b2f1b99/Bounteous%20Logo.jpeg"
    },
    {
        "id": "2600b2de-574f-4844-a148-7bc71ef31700",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2600b2de-574f-4844-a148-7bc71ef31700",
        "created_at": "Sat Feb 06 00:34:32 UTC 2021",
        "company": "Xpanse Inc.",
        "company_url": "http://www.xpanse.com",
        "location": "Bellevue, WA",
        "title": "Senior Full-Stack Software Development Engineer",
        "description": "<p>Currently it takes the same amount of time to process an average American mortgage as it does to walk nonstop from Manhattan to San Francisco. Talk about getting your steps in. This is the kind of technology – or lack thereof – that the mortgage industry is dealing with daily. Papercuts are a real concern. We have even heard rumors of fax machines and whiteout. Still no actual dinosaur sightings, but we are ever vigilant.</p>\n<p>Ready to roll up your sleeves and help us conquer the last frontier of fintech?  At Xpanse, we are working to disrupt an $11 trillion industry. Yep, you read that right - $11 trillion with a “t”. If the US mortgage industry was its own sovereign nation, it would be the third largest in the world by GDP.</p>\n<p>Suffice to say, we are building to scale. What are we building?</p>\n<p>Our SaaS platform will power the mortgage industry and its relationships with the tens of thousands of third-party providers that are integral to the mortgage process. Leveraging automation, real-time intelligence, big data, and analytics we are changing the way borrowers, lenders, servicers, and service providers take care of business.</p>\n<p>But disrupting an industry is a team sport, so we are looking for the best and brightest to join us. Our team is growing rapidly in the Greater Seattle Area and looking for <strong>Senior Full-Stack Software Development Engineers</strong> to join our team.</p>\n<p><strong>WHAT YOU WILL BE DOING</strong></p>\n<ul>\n<li>Providing technical leadership to help the team solve difficult technical problems</li>\n<li>Establishing and enforcing high standards in software engineering best practices</li>\n<li>Helping teammates become better software engineers</li>\n<li>Formulating development plans and writing lots and lots of code</li>\n</ul>\n<p><strong>WHO YOU ARE</strong></p>\n<ul>\n<li>You have a team-first mentality, and value collaborative results over personal accolades</li>\n<li>You have an owner’s instinct and sense of responsibility</li>\n<li>You have an ability to execute challenging gameplans and deliver measurable results</li>\n<li>You've demonstrated an ability to successfully engage productively with leaders and peers</li>\n</ul>\n<p><strong>BASIC QUALIFICATIONS</strong></p>\n<ul>\n<li>At least 5 years experience in the software industry as a developer delivering enterprise software</li>\n<li>Good working knowledge of service-oriented architectures, cloud-based solutions (e.g. AWS), middle-tier frameworks (e.g. Spring, .Net framework), data streaming/computation microservices (e.g. Kafka, Flink), and relational and/or non-relational databases (e.g. PostgreSQL)</li>\n<li>Fluent in Java or C#</li>\n<li>A bachelor's degree in Computer Science or related field</li>\n</ul>\n<p><strong>PREFERRED QUALIFICATIONS</strong></p>\n<ul>\n<li>Fintech, B2B/B2B2C technology, or start-up company experience</li>\n<li>Front-end development experience using modern frameworks like Node.js, React, etc.</li>\n</ul>\n<p>Xpanse is an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
        "how_to_apply": "<p>Please submit your application via this link: <a href=\"https://grnh.se/b05a537d3us\">https://grnh.se/b05a537d3us</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3lZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2e025f44e66648e8820c3d36f0c42d5da5339176/logo-v-blue@2x.png"
    }
]
}